Процедура ЗаполнитьНеОтмеченными() Экспорт
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОшибочныеЗаказыСрезПоследних.Заказ КАК Заказ,
		|	ОшибочныеЗаказыСрезПоследних.Заказ.Организатор КАК Организатор,
		|	ОшибочныеЗаказыСрезПоследних.Заказ.ПерваяТочка КАК Отправитель,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ОшибочныеЗаказыСрезПоследних.Заказ) = ТИП(Справочник.Коробки)
		|			ТОГДА ОшибочныеЗаказыСрезПоследних.Заказ.ТочкаНазначения
		|		ИНАЧЕ ОшибочныеЗаказыСрезПоследних.Заказ.ПунктВыдачи
		|	КОНЕЦ КАК Получатель
		|ИЗ
		|	РегистрСведений.ОшибочныеЗаказы.СрезПоследних(, НЕ Установлен) КАК ОшибочныеЗаказыСрезПоследних";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Заказы.Загрузить(РезультатЗапроса.Выгрузить());	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
	Документы.УстановитьВиновника.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
	ДополнительныеСвойства.Вставить("ЭтоНовый",ЭтоНовый());
	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);
	СП_ДвиженияСервер.ОтразитьДвиженияПоРегистру("ОшибочныеЗаказы", ДополнительныеСвойства, Движения, Отказ);

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	массСтрок = Заказы.НайтиСтроки(Новый  Структура("Выбранвариант",0));
	Для каждого элем из массСтрок Цикл
		
		Заказы.Удалить(Элем)
	КонецЦикла;	
	
КонецПроцедуры



#Область Обмен
Функция   	ВыгрузитьНаСайт() Экспорт
	СтоСПОбмен_Посылки_income_error.ВыгрузитьОшибочныеПоступления_incomeError(ЭтотОбъект);
КонецФункции

#КонецОбласти