&НаКлиенте
Процедура ВыполнитьВыгрузку()

	Режим = РежимДиалогаВопрос.ДаНет;
	Оповещение = Новый ОписаниеОповещения("ВыполнитьВыгрузкуЗавершение",ЭтотОбъект);
	ПоказатьВопрос(Оповещение,"Продолжить выполнение операции? Это может занять несколько минут!" ,Режим );
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьВыгрузкуЗавершение(Результат, ДопПараметры) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Закрыть();
	ВыполнитьВыгрузку();
КонецПроцедуры
