Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати 	= "Документ.ЗаказыДляТранзита";
    КомандаПечати.Идентификатор 	= "ЧекПросмотр";
	КомандаПечати.Картинка 			= БиблиотекаКартинок.Печать;
    КомандаПечати.Представление 	= НСтр("ru = 'Чек просмотр'");
	
    КомандаПечати = КомандыПечати.Добавить();
    КомандаПечати.МенеджерПечати 	= "Документ.ЗаказыДляТранзита";
    КомандаПечати.Идентификатор 	= "Чек";
	КомандаПечати.Картинка 			= БиблиотекаКартинок.ПечатьСразу;
    КомандаПечати.Представление 	= НСтр("ru = 'Чек'");
	КомандаПечати.СразуНаПринтер	=истина;

КонецПроцедуры


#Область Печать



// Формирует печатные формы.
 //Параметры:
 // МассивОбъектов  – Массив    – ссылки на объекты, которые нужно распечатать;
 // ПараметрыПечати – Структура – дополнительные настройки печати;
 // КоллекцияПечатныхФорм – ТаблицаЗначений – сформированные табличные документы (выходной параметр)
 // ОбъектыПечати         – СписокЗначений  – значение – ссылка на объект;
 //                                           представление – имя области в которой был выведен объект (выходной параметр);
 // ПараметрыВывода       – Структура       – дополнительные параметры сформированных табличных документов (выходной параметр).
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	#Если Сервер Тогда	
		НужноПечататьМакет 		= УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Чек");
		Если НужноПечататьМакет Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"Чек",
			НСтр("ru = 'Чек'"),
			СтоСП_Печать.ТабДок_ЧекаЗаказыДляТранизта(МассивОбъектов, ОбъектыПечати),
			,
			"ОбщиеМакеты.ПФ_MXL_ЧекПоступления");
		КонецЕсли;	
		
		НужноПечататьМакет = УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ЧекПросмотр");
		Если НужноПечататьМакет Тогда
			УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ЧекПросмотр",
			НСтр("ru = 'Чек просмотр'"),
			СтоСП_Печать.ТабДок_ЧекаЗаказыДляТранизта(МассивОбъектов, ОбъектыПечати),
			,
			"ОбщиеМакеты.ПФ_MXL_ЧекПоступления");
		КонецЕсли;	
		

	#КонецЕсли	
КонецПроцедуры



#КонецОбласти
