
Процедура ЧистимДоставленныеТранзиты() экспорт
	нз=РегистрыСведений.ДоставленныеТранзиты.СоздатьНаборЗаписей();
	нз.Прочитать();
	нз.Очистить();
	нз.Записать();
КонецПроцедуры	

функция ПроверятьОтветственного()  Экспорт
	возврат Константы.ПроверятьОтветственногоПриРасходе.Получить();
КонецФункции


Функция НеПечататьФискальныйЧек() Экспорт
	Возврат Константы.ФискальныйЧекНеПечатать.Получить();
КонецФункции	

Процедура УстановитьУстановитьПризнакПечатиФискальногоЧека(Признак) Экспорт
	
	Константы.ФискальныйЧекНеПечатать.Установить(Признак);
КонецПроцедуры	