Функция ПолучитьРеквизитыУчастника(ПараметрУчастники) Экспорт
	Если ТипЗнч(ПараметрУчастники) = Тип("Строка") Тогда
		списокУчастников = Новый СписокЗначений;
		списокУчастников.Добавить(ПараметрУчастники);
	ИначеЕсли ТипЗнч(ПараметрУчастники) = Тип("Число") Тогда
		списокУчастников = Новый СписокЗначений;
		списокУчастников.Добавить(Формат(ПараметрУчастники, "ЧГ=0"));
	ИначеЕсли ТипЗнч(ПараметрУчастники) = Тип("СправочникСсылка.Участники") Тогда
		списокУчастников = Новый СписокЗначений;
		списокУчастников.Добавить(Формат(ПараметрУчастники.Код, "ЧГ=0"));
	Иначе
		списокУчастников = ПараметрУчастники;
	КонецЕсли;

	Параметры=Новый Структура;
	Параметры.Вставить("token", Константы.Токен.Получить());
	Параметры.Вставить("xml", 	СтоСПОбмен_Запрос.УчастникПоИД(списокУчастников));

	АдресСкрипта        = Константы.АдресЗагрузкиССайта.Получить();
//	ИмяФайлаОтвета		= СтоСПОбмен_Общий.ПолучитьПостЗапросом_Ответ(Параметры,АдресСкрипта);
	ИмяФайлаОтвета		= СтоСПОбмен_Общий.ПолучитьПостЗапросом(Параметры, АдресСкрипта);
	Если аспПроцедурыОбменаДанными.АвторизацияВыполнена(ИмяФайлаОтвета) Тогда
		тзУчастники		= аспПроцедурыОбменаДанными.ОбработатьЗагруженныеССайтаДанные(ИмяФайлаОтвета).Участники;
	КонецЕсли;
	Если тзУчастники.Количество()=0 Тогда
		Возврат неопределено;
	КонецЕсли;	
	Параметры = Новый Структура;
	Параметры.Вставить("ТелефонХэш", тзУчастники[0].phoneHash);
	
	
	
КонецФункции	


Функция ПолучитьРеквизитыУчастникаПоНомеруТелефона(НомерТелефона) Экспорт

	Параметры			=Новый Структура;
	Параметры.Вставить("token", Константы.Токен.Получить());
	Параметры.Вставить("xml", 	СтоСПОбмен_Запрос.УчастникПоНомеруТелефона(НомерТелефона));

	АдресСкрипта        = Константы.АдресЗагрузкиССайта.Получить();
	
	хмл_отправили		= СтоСПОбмен_Запрос.УчастникПоНомеруТелефона(НомерТелефона);
	Ответ = СтоСПОбмен_Выгрузка100сп.Загрузить(хмл_отправили);
	
	Если Ответ.Разбор.Свойство("userPhone") Тогда
		структураУчастника = Ответ.Разбор.userPhone[0];
		Если	структураУчастника.result= "error" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(структураУчастника.message);
			Возврат неопределено;
		КонецЕсли;
		Участник = СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(структураУчастника.id);
		ПараметрыУчастника = новый Структура;
		ПараметрыУчастника.Вставить("Наименование", структураУчастника.name);
		ПараметрыУчастника.Вставить("ТелефонХэш",	структураУчастника.phoneHash);
		ПараметрыУчастника.Вставить("Рэйтинг",		структураУчастника.rating);
		ПараметрыУчастника.Вставить("Статус",		структураУчастника.status);
		ПараметрыУчастника.Вставить("Телефон1",		структураУчастника.phone);
		ПараметрыУчастника.Вставить("Город",		СП_РаботаСоСправочниками.ПолучитьГородПокупкиПо_Коду(структураУчастника.city_id));
		СП_РаботаСоСправочниками.ОбновитьУчастника(Участник,ПараметрыУчастника);
		Возврат Новый Структура("Участник, Код,Ссылка, Наименование, Телефон", структураУчастника.name,структураУчастника.id,Участник,Участник,структураУчастника.phone);
	Иначе	
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не удалось получитт участника по номеру телефона");
		Возврат неопределено;
	КонецЕсли;
	
	
КонецФункции