Процедура ПоказатьQRкод()
	
	
	Если ЗначениеЗаполнено(Объект.Ссылка) тогда              
		СвойПВ = Константы.СвояТочка.Получить();
		QRстрока =  "pv_cod="+СвойПВ.Код +Символы.ПС+
					"pv_name="+СвойПВ.Наименование +Символы.ПС+
					"mk_cod="+Объект.Код +Символы.ПС+	       
					"serv_string="+Константы.мкСтрокаПодключения.Получить()+Символы.ПС+
					"user_name="+константы.мкПользователь.Получить()+Символы.ПС+
					"user_pass="+константы.мкПароль.Получить();
		
		пользователь =  Справочники.Пользователи.НайтиПоНаименованию("upd");
		СвойстваПользователяИБ = Пользователи.СвойстваПользователяИБ(Пользователь.ИдентификаторПользователяИБ);;
		Изображение = ПоместитьВоВременноеХранилище(УправлениеПечатью.ДанныеQRКода(QRстрока,1,300));
	КонецЕсли;	
КонецПроцедуры

Функция ПараметрыПодключения(QRстрока)
	Результат =  новый Структура;
	строки = СтрРазделить(QRстрока,Символы.ПС);	
	Для каждого стр из строки Цикл
		папам = СтрРазделить(стр,"=");
		Результат.Вставить(папам[0],папам[1])
	КонецЦикла;	 
	Возврат Результат;
КонецФункции	


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
		ПоказатьQRкод();		
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПоказатьQRкод();		
КонецПроцедуры   

Функция ПолучитьНаименование()
	
	Возврат "клиент для "+Объект.Сотрудник.Наименование;	
Конецфункции	

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Объект.Наименование = ПолучитьНаименование();
КонецПроцедуры
