
Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияПередЗаписью(Источник, Отказ) Экспорт
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(
		"СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ);
КонецПроцедуры

Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента(
		"СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура СинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияУдаленияПередУдалением(Источник, Отказ) Экспорт
	
	// ОбменДанными.Загрузка не требуется, т.к. подписка относиться к плану обмена.
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(
		"СинхронизацияДанныхЧерезУниверсальныйФормат", Источник, Отказ);

КонецПроцедуры

Процедура mobileСинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияПередЗаписью(Источник, Отказ) Экспорт
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью(
	//	"mobileМенеджерОбменаЧерезУниверсальныйФормат", Источник, Отказ);
КонецПроцедуры

Процедура mobileСинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияДокументаПередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюДокумента(
	//	"mobileМенеджерОбменаЧерезУниверсальныйФормат", Источник, Отказ, РежимЗаписи, РежимПроведения);

КонецПроцедуры

Процедура mobileСинхронизацияДанныхЧерезУниверсальныйФорматРегистрацияУдаленияПередУдалением(Источник, Отказ) Экспорт
	//ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением(
	//	"mobileМенеджерОбменаЧерезУниверсальныйФормат", Источник, Отказ);

КонецПроцедуры
