#Область Заполнение

&НаСервере
Процедура ЗаполнитьНаСервере()
	докОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	докОбъект.ЗаполнитьПросроченнымиЗаказами();
	ЗначениеВДанныеФормы(докОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПолученныеНаСервере()
	докОбъект = ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	докОбъект.ОтметитьПринятыеЗаказы();
	ЗначениеВДанныеФормы(докОбъект,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПолученные(Команда)
	ЗаполнитьПолученныеНаСервере();
КонецПроцедуры

#КонецОбласти 

&НаКлиенте
Процедура Отписаться(Команда)
	ДополнительныеПараметры = Элементы.Заказы.ВыделенныеСтроки;
	
	
		ОткрытьФорму("Документ.ПотерянныеЗаказы.Форма.Форма_РешенияВопроса",
					Новый Структура("ВопросРешен,Комментарий, Посылка, Коробка ,ГруппаЗаказов",
									Элементы.Заказы.ТекущиеДанные.ВопросРешен, 
									Элементы.Заказы.ТекущиеДанные.Комментарий,
									Элементы.Заказы.ТекущиеДанные.Посылка,
									Элементы.Заказы.ТекущиеДанные.Коробка,
									(Элементы.Заказы.ВыделенныеСтроки.Количество()>1)),
					ЭтотОбъект,,,,Новый ОписаниеОповещения("РешитьВопрос_Завершение", ЭтотОбъект,ДополнительныеПараметры),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры



&НаКлиенте
Процедура ЗаказыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ДополнительныеПараметры = Элементы.Заказы.ВыделенныеСтроки;
	ОткрытьФорму("Документ.ПотерянныеЗаказы.Форма.Форма_РешенияВопроса",
					Новый Структура("ВопросРешен,Комментарий, Посылка, Коробка ,ГруппаЗаказов",
									Элементы.Заказы.ТекущиеДанные.ВопросРешен, 
									Элементы.Заказы.ТекущиеДанные.Комментарий,
									Элементы.Заказы.ТекущиеДанные.Посылка,
									Элементы.Заказы.ТекущиеДанные.Коробка,
									Ложь),
					ЭтотОбъект,,,,Новый ОписаниеОповещения("РешитьВопрос_Завершение", ЭтотОбъект,ДополнительныеПараметры),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры


&НаКлиенте
Процедура РешитьВопрос_Завершение(Результат, ДополнительныеПараметры)  Экспорт
	Если Результат <> Неопределено Тогда
		Для каждого пн из ДополнительныеПараметры Цикл
			элем = Объект.Заказы[пн];
			ЗаполнитьЗначенияСвойств(элем, Результат);	
			элем.ДатаКомментария 	= ТекущаяДата();
			элем.Выгружать 			= (Результат.Комментарий <> "");
			элем.Отправлено 		= Ложь;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ГруппаСтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыНаСервере()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница=Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПротокол Тогда
		парамДок				= Протокол.Параметры.Элементы.Найти("Документ");
		парамДок.Значение		= Объект.Ссылка;
		парамДок.Использование	= Истина;
	Конецесли;	
КонецПроцедуры


&НаСервере
Функция  ПросмотрXMLНаСервере()
	
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	Возврат СтоСПОбмен_ПотерянныеЗаказы_lostOrder.СкомпоноватьДляВыгрузки(об);
КонецФункции



&НаКлиенте
Процедура ПросмотрXML(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	хмл_incomes=ПросмотрXMLНаСервере();
	СтоСП_Клиент.Показать_XML(хмл_incomes);

КонецПроцедуры



&НаКлиенте
Процедура ПросмотрПолученногоXML(Команда)
	хмл_incomes = Элементы.Протокол.ТекущиеДанные.ПолученныеДанные;
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры


&НаКлиенте
Процедура Отправить(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;	
	ОтправитьНаСервере();

КонецПроцедуры

&НаСервере
Процедура ОтправитьНаСервере()
	об	=	ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ПотерянныеЗаказы"));
	об.ВыгрузитьНаСайт();
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Оповестить("ЗакрытПотерянныеЗаказы");
КонецПроцедуры

&НаКлиенте
Процедура НакладныеПриАктивизацииСтроки(Элемент)
	Если Элемент.текущиеДанные	= неопределено Тогда Возврат; КонецЕсли;
	Элементы.Заказы.ОтборСтрок	= новый ФиксированнаяСтруктура("НомерНакладной, ДатаНакладной, ПунктВыдачи",
																Элемент.текущиеДанные.НомерНакладной,
																Элемент.текущиеДанные.ДатаНакладной,
																Элемент.текущиеДанные.ПунктВыдачи);
	Элементы.ЗаказыНомерНакладной.Видимость = Ложь;
	Элементы.ЗаказыДатаНакладной.Видимость = Ложь;
	Элементы.ЗаказыПунктВыдачи.Видимость = Ложь;

КонецПроцедуры

&НаКлиенте
Процедура 	ПоказатьВсе(Команда)
	Элементы.Заказы.ОтборСтрок	= Неопределено;
	Элементы.ЗаказыНомерНакладной.Видимость = Истина;
	Элементы.ЗаказыДатаНакладной.Видимость = Истина;
	Элементы.ЗаказыПунктВыдачи.Видимость = Истина;

КонецПроцедуры




