


#Область Вспомогательные

Функция СоздатьЗаявкуНаДоставку(об_XDTO,КодУчастникаОтпровителя) Экспорт
	
	КодЗаявки			= Формат(Число(об_XDTO.orderId),"ЧГ=0");
	Заявка				= Справочники.ЗаявкаНаДоставку.НайтиПоКоду(КодЗаявки);	
	Если не ЗначениеЗаполнено(Заявка) Тогда
		обЗаявка		= Справочники.ЗаявкаНаДоставку.СоздатьЭлемент();
		обЗаявка.Код	= КодЗаявки;
	Иначе	
		обЗаявка		= Заявка.ПолучитьОбъект();
	КонецЕсли;	
	обЗаявка.Наименование			= "З("+об_XDTO.requestContent+")";
	обЗаявка.УчастникОтправитель 	= СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(КодУчастникаОтпровителя);
	обЗаявка.Участник         		= СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(об_XDTO.uid);
	обЗаявка.ТочкаНазначения		= СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду(об_XDTO.distributorCode);
	обЗаявка.ОценочнаяСтоимость		= об_XDTO.estimatedCost;
	обЗаявка.bulletinId				= об_XDTO.requestId;
	обЗаявка.secureCode				= об_XDTO.secureCode;
	Попытка
		обЗаявка.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	Возврат обЗаявка.Ссылка;	
	
КонецФункции



#КонецОбласти

