Функция ОбновитьСписокПрав() Экспорт
	хмл_отправили	= СписокПравХМЛ();	
	АдресСкрипта	=  "api/distributor";
	хмл_получили 	= СтоСПОбмен_Общий.Загрузить(хмл_отправили, АдресСкрипта);
	Если хмл_получили = Неопределено Тогда
		Возврат неопределено;
	КонецЕсли;	
	Возврат Разбор(хмл_получили);	
	
КонецФункции

Функция СписокПравХМЛ() 

	ЗаписьXML=новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьНачалоЭлемента("distributors");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsi","http://www.w3.org/2001/XMLSchema-instance");
	ЗаписьXML.ЗаписатьАтрибут("xmlns:xsd","http://www.w3.org/2001/XMLSchema");
	ЗаписьXML.ЗаписатьАтрибут("apiVersion","15");
	///////
	ЗаписьXML.ЗаписатьНачалоЭлемента("returnRights");	
	ЗаписьXML.ЗаписатьКонецЭлемента();           //incomes
	//////
	ЗаписьXML.ЗаписатьКонецЭлемента();           //distributors
	Возврат ЗаписьXML.Закрыть();
	
	
КонецФункции



Функция Разбор(ПолученныеДанные) 
	пространствоИмен		= "http://www.100sp.ru/api/distributor/upload/back";
	ПолученныеДанные		= СтрЗаменить(ПолученныеДанные,"http://www.100sp.ru",пространствоИмен);
	
	
	ПолученоЭлементов = 0;
	авторизацияВыполнена	= ложь;
	Если ПолученныеДанные 	= "Не удалось соеденится с сайтом" Тогда 
		Возврат Новый Структура("ПолученоЭлементов,Ошибок",0,1); 
	КонецЕсли;
	
	Тип_distributors		= ФабрикаXDTO.Тип(пространствоИмен, "distributors");
	
	ЧтениеXML 				= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПолученныеДанные);
 	Объект_distributors		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,Тип_distributors);
	
	Если Объект_distributors.auth.result="ok" Тогда
		Если Объект_distributors.returnRights = Неопределено Тогда
			авторизацияВыполнена= Ложь;
		Иначе      
			нз = РегистрыСведений.ВозвратыПрава.СоздатьНаборЗаписей();
			нз.Прочитать();
			нз.Очистить();
			Для каждого элем из Объект_distributors.returnRights.returnRight Цикл
				новаяЗапись = нз.Добавить();				
				новаяЗапись.Участник = СП_РаботаСоСправочниками.ПолучитьУчастникаПо_Коду(элем.userId);			
				новаяЗапись.Организатор = СП_РаботаСоСправочниками.ПолучитьОрганизатораПо_Коду(элем.orgId);
				новаяЗапись.Покупка = СП_РаботаСоСправочниками.ПолучитьПокупкуПо_Коду(элем.Pid);
				новаяЗапись.Мегаордер = элем.megaorderId;
				новаяЗапись.Срок = СтоСПОбмен_Общий.ДатаИзСтроки(Элем.expiresAt);
				ПолученоЭлементов = ПолученоЭлементов + 1;
			КонецЦикла;
			нз.Записать(Истина);
		КонецЕсли;
		авторизацияВыполнена=истина;
	Иначе
		ТекстСоообщения = "Не удалось получить права возвратов. Не удалось подключиться к сайту";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСоообщения);
		авторизацияВыполнена= Ложь;
	КонецЕсли;
	Если авторизацияВыполнена Тогда
		Ошибок = 0;
	Иначе
		Ошибок = 1;
	КонецЕсли;	
	Результат = Новый Структура("ПолученоЭлементов,Ошибок",ПолученоЭлементов,Ошибок);
	Возврат	Результат;
КонецФункции
          
		  

