
#Область ПрограммныйИнтерфейс
Процедура ОтразитьДвиженияДанныеЗаказов(ДвиженияДанныеЗаказов, Ссылка) Экспорт
	Запрос = Новый Запрос;     
	Запрос.текст  ="ВЫБРАТЬ
		              |	Посылки.Ссылка.Дата КАК Период,
		              |	Посылки.Ссылка КАК Партия,
		              |	Посылки.Посылка КАК Заказ,
		              |	Посылки.Габарит КАК Габарит,
		              |	Посылки.Вес КАК Вес,
		              |	Посылки.объем КАК Объем,
		              |	1 КАК Количество,
		              |	Посылки.ОтдельнымМестом КАК ОтдельнымМестом,
		              |	Посылки.ДатаПриема КАК ДатаПриема,
		              |	НЕ Посылки.Оплачен КАК НеОплачен,
		              |	Посылки.Коробка КАК Коробка,
		              |	Посылки.МестоХранения КАК МестоХранения
		              |ИЗ
		              |	Документ.РазборКоробки.Посылки КАК Посылки
		              |ГДЕ
		              |	Посылки.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Группы.Ссылка.Дата,
		              |	Группы.Ссылка,
		              |	Группы.Коробка,
		              |	Группы.Габарит,
		              |	Группы.Вес,
		              |	Группы.объем,
		              |	Группы.Количество,
		              |	Группы.ОтдельнымМестом,
		              |	Группы.ДатаПриема,
		              |	ЛОЖЬ,
		              |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки),
		              |	Группы.МестоХранения
		              |ИЗ
		              |	Документ.РазборКоробки.ГруппыНаТранзит КАК Группы
		              |ГДЕ
		              |	Группы.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Посылки.Ссылка.Дата КАК Период,
		              |	Посылки.Ссылка КАК Партия,
		              |	Посылки.Посылка КАК Заказ,
		              |	Посылки.Габарит КАК Габарит,
		              |	Посылки.Вес КАК Вес,
		              |	Посылки.объем КАК Объем,
		              |	1 КАК Количество,
		              |	Посылки.ОтдельнымМестом КАК ОтдельнымМестом,
		              |	Посылки.ДатаПриема КАК ДатаПриема,
		              |	НЕ Посылки.Оплачен КАК НеОплачен,
		              |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки) КАК Коробка,
		              |	Посылки.МестоХранения КАК МестоХранения
		              |ИЗ
		              |	Документ.Приходная.Посылки КАК Посылки
		              |ГДЕ
		              |	Посылки.Ссылка = &Ссылка
		              |
		              |ОБЪЕДИНИТЬ ВСЕ
		              |
		              |ВЫБРАТЬ
		              |	Покупки.Ссылка.Дата,
		              |	Покупки.Ссылка,
		              |	Покупки.Покупка,
		              |	Покупки.Габарит,
		              |	Покупки.Вес,
		              |	Покупки.объем,
		              |	1,
		              |	Покупки.ОтдельнымМестом,
		              |	Покупки.ДатаПриема,
		              |	НЕ Покупки.Оплачен,
		              |	ЗНАЧЕНИЕ(Справочник.Коробки.БезКоробки),
		              |	Покупки.МестоХранения
		              |ИЗ
		              |	Документ.Приходная.Покупки КАК Покупки
		              |ГДЕ
		              |	ТИПЗНАЧЕНИЯ(Покупки.Покупка) = ТИП(Справочник.Коробки)
		              |	И Покупки.Ссылка = &Ссылка";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Результат = Запрос.Выполнить();        
	выборка = Результат.Выбрать();
	ДвиженияДанныеЗаказов.записывать = Истина;
	Пока Выборка.Следующий() Цикл
		движение = ДвиженияДанныеЗаказов.Добавить();
		ЗаполнитьЗначенияСвойств(движение,ВЫборка);
	КонецЦикла;		
	
КонецПроцедуры	


Процедура ОтразитьДвиженияПоРегистру(НазваниеРегистра, ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаДвижений = ДополнительныеСвойства.ТаблицыДляДвижений["Таблица"+НазваниеРегистра];
	
	Если Отказ ИЛИ ТаблицаДвижений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияРегистра = Движения[НазваниеРегистра];
	ДвиженияРегистра.Записывать = Истина;
	ДвиженияРегистра.Загрузить(ТаблицаДвижений);
	
КонецПроцедуры




// Процедура формирования движений по регистру "НеВыгруженноНаСайт ".
//
// Параметры:
//  ДополнительныеСвойства - Структура - Структура дополнительных свойств для проведения.
//  Движения - Структура - Структура наборов движений документа.
//  Отказ - Булево - Признак отказа от проведения документа.
//
Процедура ОтразитьНеВыгруженноНаСайт(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаНеВыгруженноНаСайт = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаНеВыгруженноНаСайт;
	
	Если Отказ ИЛИ ТаблицаНеВыгруженноНаСайт.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияНеВыгруженноНаСайт = Движения.НеВыгруженноНаСайт;
	ДвиженияНеВыгруженноНаСайт.Записывать = Истина;
	ДвиженияНеВыгруженноНаСайт.Загрузить(ТаблицаНеВыгруженноНаСайт);
	
КонецПроцедуры

Процедура ОтразитьТранзит(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаТранзит = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаТранзит;
	
	Если Отказ ИЛИ ТаблицаТранзит.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияТранзит = Движения.Транзит;
	ДвиженияТранзит.Записывать = Истина;
	ДвиженияТранзит.Загрузить(ТаблицаТранзит);
	
КонецПроцедуры




Процедура ОтразитьОстаткиТоваров(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаОстаткиТоваров = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаОстаткиТоваров;
	
	Если Отказ ИЛИ ТаблицаОстаткиТоваров.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияОстаткиТоваров = Движения.ОстаткиТоваров;
	ДвиженияОстаткиТоваров.Записывать = Истина;
	ДвиженияОстаткиТоваров.Загрузить(ТаблицаОстаткиТоваров);
	
КонецПроцедуры


Процедура ПроверитьОтрицательныеОстаткиНаСкладе(Ссылка, СписокНоменклатуры, Отказ) Экспорт
	//Если Не Константы.КонтралироватьОстаткиПриРасходе.Получить() Тогда
	//	Возврат ;	
	//КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Покупка КАК Покупка,
		|	ОстаткиТоваровОстатки.Габарит КАК Габарит,
		|	ОстаткиТоваровОстатки.МестоХранения КАК МестоХранения,
		|	ОстаткиТоваровОстатки.Участник КАК Участник
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&МоментВремени,
		|				Покупка В (&СписокНоменклатуры)) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	
	Запрос.УстановитьПараметр("МоментВремени", Новый Граница(Ссылка.МоментВремени(),ВидГраницы.Включая));
	Запрос.УстановитьПараметр("СписокНоменклатуры", СписокНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		Выборка= РезультатЗапроса.Выбрать();
		
		ТекстСообщениея = "В результате проведения " +Ссылка+ " Возникает отрицательный остаток по следующим позициям :"+Символы.ПС;
		Пока Выборка.Следующий() Цикл
			ТекстСообщениея = ТекстСообщениея + Выборка.Покупка +" для "+ выборка.Участник + ", г: "+Выборка.Габарит + ", мх: " +Выборка.МестоХранения;
		КонецЦикла;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщениея);
	КонецЕсли;
	
	
	
КонецПроцедуры	

Процедура ОтразитьУпакованныеЗаказы(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаУпакованныеЗаказы = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаУпакованныеЗаказы;
	
	Если Отказ ИЛИ ТаблицаУпакованныеЗаказы.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияУпакованныеЗаказы= Движения.УпакованныеЗаказы;
	ДвиженияУпакованныеЗаказы.Записывать = Истина;
	ДвиженияУпакованныеЗаказы.Загрузить(ТаблицаУпакованныеЗаказы);
	
КонецПроцедуры



Процедура ОтразитьЗаказыВПосылках(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаЗаказыВПосылках = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаЗаказыВПосылках;
	
	Если Отказ ИЛИ ТаблицаЗаказыВПосылках.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияЗаказыВПосылках = Движения.ЗаказыВПосылках;
	ДвиженияЗаказыВПосылках.Записывать = Истина;
	ДвиженияЗаказыВПосылках.Загрузить(ТаблицаЗаказыВПосылках);
	
КонецПроцедуры

Процедура ОтразитьПриход(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПриход = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПриход;
	
	Если Отказ ИЛИ ТаблицаПриход.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПриход = Движения.Приход;
	ДвиженияПриход.Записывать = Истина;
	ДвиженияПриход.Загрузить(ТаблицаПриход);
	
КонецПроцедуры

Процедура ОтразитьРасход(ДополнительныеСвойства, Движения, Отказ) Экспорт

	Таблица_Движений = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаРасход;
	
	Если Отказ ИЛИ Таблица_Движений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПриход = Движения.Расход;
	ДвиженияПриход.Записывать = Истина;
	ДвиженияПриход.Загрузить(Таблица_Движений);
	
КонецПроцедуры


Процедура ОтразитьПродажи(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаПродажи = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаПродажи;
	
	Если Отказ ИЛИ ТаблицаПродажи.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияПродажи = Движения.Продажи;
	ДвиженияПродажи.Записывать = Истина;
	ДвиженияПродажи.Загрузить(ТаблицаПродажи);
	
КонецПроцедуры

Процедура ОтразитьКПолучению(ДополнительныеСвойства, Движения, Отказ) Экспорт

	ТаблицаКПолучению = ДополнительныеСвойства.ТаблицыДляДвижений.ТаблицаКПолучению;
	
	Если Отказ ИЛИ ТаблицаКПолучению.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	ДвиженияКПолучению = Движения.КПолучению;
	ДвиженияКПолучению.Записывать = Истина;
	ДвиженияКПолучению.Загрузить(ТаблицаКПолучению);
	
КонецПроцедуры


#КонецОбласти