
&НаСервере
Процедура СинхронизироватьНаСервере()
	если не ЗначениеЗаполнено(Объект.Ссылка) Тогда Записать() КонецЕсли;
	об = РеквизитФормыВЗначение("Объект");
	об.Синхронизировать(Объект.ОборотнаяТара);
	ЗначениеВДанныеФормы(об, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Синхронизировать(Команда)
	Если не ЗначениеЗаполнено(Объект.ОборотнаяТара) Тогда Возврат КонецЕсли;
	СинхронизироватьНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ГруппаСтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыНаСервере()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПротокол Тогда
		парамДок				= Протокол.Параметры.Элементы.Найти("Документ");
		парамДок.Значение		= Объект.Ссылка;
		парамДок.Использование	= Истина;
	Конецесли;	
КонецПроцедуры


&НаСервере
Функция  ПросмотрXMLНаСервере(НомерСтроки = Неопределено)
	
	
	об=РеквизитФормыВЗначение("Объект");
	Возврат СтоСПОбмен_Запрос.ВыгрузкаПоступлений_income(об,НомерСтроки);
КонецФункции

&НаКлиенте
Процедура ПросмотрXML(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	//Элементы.Данные.
	хмл_incomes=ПросмотрXMLНаСервере();
	СтоСП_Клиент.Показать_XML(хмл_incomes);

КонецПроцедуры

&НаКлиенте
Процедура ПросмотьXMLпоСтроке(Команда)
	Если Элементы.Данные.ТекущаяСтрока = неопределено Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не выбрана строка");
		Возврат;
	КонецЕсли;	
	НомерСтроки = Объект.Данные.НайтиПоИдентификатору(Элементы.Данные.ТекущаяСтрока).НомерСтроки;
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	//Элементы.Данные.
	хмл_incomes=ПросмотрXMLНаСервере(НомерСтроки);
	СтоСП_Клиент.Показать_XML(хмл_incomes);

КонецПроцедуры

&НаКлиенте
Процедура ПросмотрПолученногоXML(Команда)
	хмл_incomes = Элементы.Протокол.ТекущиеДанные.ПолученныеДанные;
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры
