

&НаКлиенте
Процедура НачатьОтгрузку(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	УстановитьСостояниеОтгрузки(ПунктВыдачи, Истина);
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ПередатьКурьеру(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);	
	
	НоваяМетодика = СинхронизацияПоступлений.НоваяМетодика(ТекущаяДата());
	Если НоваяМетодика Тогда
		СинхронизацияПоступлений.Синхронизировать(ПунктВыдачи);
		ОткрытьФорму(	"Документ.ВыдачаТранзита.ФормаОбъекта",
		новый Структура("ТочкаНазначения",ПунктВыдачи),ЭтаФорма,Истина,,,ОписаниеОповещения);
		
	Иначе	
		
		
		
		ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
		новый Структура("ИсточникВызова, ПунктВыдачи, ОшибочныеЗаказы","ВыдачаТранзита",ПунктВыдачи, Ложь),
		ЭтаФорма,Истина,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
		
	КонецЕсли;		
	Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияформыДокумента(Результат, ДопПараметры) Экспорт
	Элементы.СостоянияОтгрузки.Обновить();
//	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура ВернутьОшибочныеЗаказы(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);	
	
	НоваяМетодика = СинхронизацияПоступлений.НоваяМетодика(ТекущаяДата());
	Если НоваяМетодика Тогда
		СинхронизацияПоступлений.Синхронизировать(ПунктВыдачи);
		ОткрытьФорму(	"Документ.ВыдачаТранзита.ФормаОбъекта",
		новый Структура("ТочкаНазначения, ОшибочныеЗаказы",ПунктВыдачи, Истина),ЭтаФорма,Истина,,,ОписаниеОповещения);
		
	Иначе	

	
		
		ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
		новый Структура("ИсточникВызова, ПунктВыдачи, ОшибочныеЗаказы","ВыдачаТранзита",ПунктВыдачи, Истина),
		ЭтаФорма,Истина,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СформироватьДвижениеТранзита(Команда)
		ПунктыВыдачи 		= Элементы.СостоянияОтгрузки.ВыделенныеСтроки;
		Если ПунктыВыдачи.Количество()=0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выберите один или несколько пунктов выдачи!");
			Возврат;
		КонецЕсли;	
		
		ПараметрыЗаполнения	= Новый Структура();
		ПараметрыЗаполнения.Вставить("Дата", 			ТекущаяДата());
		ПараметрыЗаполнения.Вставить("ВидОперации", 	"ТранзитНаТранзит");
		ПараметрыЗаполнения.Вставить("МестоХранения", 	Неопределено);
		ПараметрыЗаполнения.Вставить("Габарит", 		Неопределено);
		ПараметрыЗаполнения.Вставить("Организатор", 	Неопределено);  
		ПараметрыЗаполнения.Вставить("ПунктВыдачи",		Новый Структура("ВидСравнения, ПравоеЗначение", ВидСравненияКомпоновкиДанных.ВСписке,ПунктыВыдачи));  
		ПараметрыЗаполнения.Вставить("ДатаОтчета", 		КонецДня(ТекущаяДата()));
		
		
    	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);
	
		ОткрытьФорму("Документ.ДвижениеТранзита.ФормаОбъекта",Новый структура("ПараметрыЗаполнения",ПараметрыЗаполнения) ,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс  );

КонецПроцедуры



&НаСервере
Процедура СформироватьВыдачуТранзитаНаСервере()

КонецПроцедуры


&НаКлиенте
Процедура ЗавершитьОтгрузку(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	УстановитьСостояниеОтгрузки(ПунктВыдачи,Ложь);
	Элементы.СостоянияОтгрузки.Обновить();
КонецПроцедуры

&НаСервере
Процедура УстановитьСостояниеОтгрузки(ПунктВыдачи, ПроизводитсяОтгрузка)
	ПВ = ПунктВыдачи.ПолучитьОбъект();
	ПВ.ПроизводитсяОтгрузка = ПроизводитсяОтгрузка;
	Попытка
		ПВ.Записать();
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
	КонецПопытки;
КонецПроцедуры


Процедура ОтключениеНовогоПоискаВСписках(Форма)
	
//	Список = Форма.Элементы.Найти("СостоянияОтгрузки");
//	Если Список = Неопределено Тогда
//		Возврат;
//	КонецЕсли;
//	
//	Список.ПоложениеСтрокиПоиска = ПоложениеСтрокиПоиска.Нет;
//	
//	ДополнениеСтрокаПоиска = Форма.Элементы.Найти("ДополнениеСтрокаПоиска");
//	Если НЕ ДополнениеСтрокаПоиска = Неопределено Тогда
//		ДополнениеСтрокаПоиска.Видимость = Ложь;
//	КонецЕсли;
		
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОтключениеНовогоПоискаВСписках(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура УпаковатьЗаказы(Команда)
	ПунктВыдачи = Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
	ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
				новый Структура("ИсточникВызова, ПунктВыдачи","УпаковатьЗаказы",ПунктВыдачи),
				ЭтаФорма,Истина);	
КонецПроцедуры



