
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ПараметрыОтбора = Новый Структура("ВидСтикера", ПредопределенноеЗначение("Перечисление.ВидыСтикеров.ГруппаДоставки"));
	
	ОткрытьФорму("Справочник.Коробки.Форма.ФормаСпискаТК",
	             Новый Структура("Отбор", ПараметрыОтбора),
	             ПараметрыВыполненияКоманды.Источник,
	             Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000002"),
	             ПараметрыВыполненияКоманды.Окно);
КонецПроцедуры
