
&НаКлиенте
Процедура ВыбратьПунктСдачиDPD(Команда)
	ОткрытьФорму("Справочник.ТранспортныеКомпании.Форма.ВыборПунктаВыдачиDPD",,ЭтаФорма,,,,новый ОписаниеОповещения("Обработчик_ВыборПунктаСдачиDPD",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

Процедура Обработчик_ВыборПунктаСдачиDPD(РезультатЗакрытия, параметр)
	Объект.КодПунктаСдачи 		= РезультатЗакрытия.КодПВ;
	Объект.КодГородаОтправителя = РезультатЗакрытия.КодГорода;
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьПунктВыдачиСДЭК()
	ОткрытьФорму("Справочник.ТранспортныеКомпании.Форма.ВыборПунктаВыдачиСДЭК",,ЭтаФорма,,,,новый ОписаниеОповещения("Обработчик_ВыборПунктаСдачиСДЭК",ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
КонецПроцедуры

Процедура Обработчик_ВыборПунктаСдачиСДЭК(РезультатЗакрытия, параметр)
	Объект.КодПунктаСдачи 		= РезультатЗакрытия.code;
	Объект.КодГородаОтправителя = РезультатЗакрытия.City_Code;
КонецПроцедуры	


Процедура УстановитьВидимость()
	Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаСДЭК.Видимость	 = (Объект.Ссылка = справочники.ТранспортныеКомпании.СДЭК); 
	Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаDPD.Видимость	 	 = (Объект.Ссылка = справочники.ТранспортныеКомпании.DPD); 

КонецПроцедуры	