
Функция СоздатьТаблицуОтчета(ПараетрыТаблицы, ЭтаФорма) Экспорт
	
	количествоСтрок = ПараетрыТаблицы.Таблица.Количество();

	
	МассивТипаВыбора 		= Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаВыбора 		= Новый ОписаниеТипов(МассивТипаВыбора);
	
	
	ИмяТаблицы			= ПараетрыТаблицы.ИмяТаблицы;
	ЗаголовокТаблицы	= ПараетрыТаблицы.ЗаголовокТаблицы;

	
	ИмяСписка			= "Список"+ИмяТаблицы;
	ИмяГруппы			= "Группа"+ИмяТаблицы;
	ИмяТЗ 				= "Таблица"+ИмяТаблицы;
	ЗаголовокТЗ 		= ИмяТаблицы;
	
	
	Попытка
	    РеквизитыДляУдаления = Новый Массив;
		элемент = ЭтаФорма.Элементы.Найти(ИмяТЗ);
		Если элемент<> Неопределено Тогда
			ЭтаФорма.Элементы.Удалить(Элемент);
		КонецЕсли;	
		РеквизитыДляУдаления.Добавить(ИмяТЗ);
		ЭтаФорма.ИзменитьРеквизиты(,РеквизитыДляУдаления);	
	Исключение
		Ошибка = ОписаниеОшибки();
		а = 1;
	КонецПопытки;
	
	
	страницаНаформе =  ЭтаФорма.Элементы.ГруппаСтраницы.ПодчиненныеЭлементы[ИмяГруппы];
	страницаНаформе.Заголовок = ЗаголовокТаблицы + " ("+количествоСтрок+")";
	
	МассивРеквизитов 	= Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяТЗ, ОписаниеТипаВыбора, "", ЗаголовокТЗ));	
	Для Каждого Колонка Из ПараетрыТаблицы.Таблица.Колонки Цикл
		
		
		ТипыЗначений = Новый Массив;
		Для Каждого тТип Из Колонка.ТипЗначения.Типы() Цикл
			Если тТип <> Тип("Null") Тогда
				ТипыЗначений.Добавить(тТип);
			КонецЕсли;
		КонецЦикла;

		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(ТипыЗначений), ИмяТЗ));
	КонецЦикла;
    ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	
	
	
	Если количествоСтрок = 0  Тогда Возврат Неопределено; КонецЕсли;
	
	эТаблица 							= ЭтаФорма.Элементы.Добавить(ИмяТЗ, Тип("ТаблицаФормы"), страницаНаформе);
	эТаблица.ПутьКДанным 				= ИмяТЗ;
	эТаблица.Отображение 				= ОтображениеТаблицы.Список;
	эТаблица.ПоложениеКоманднойПанели 	= ПоложениеКоманднойПанелиЭлементаФормы.Верх;
	эТаблица.ИзменятьСоставСтрок 		= Ложь;   	
	
	
		Для Каждого Колонка Из ПараетрыТаблицы.Таблица.Колонки Цикл
		    Видимость = ПараетрыТаблицы.Колонки.Свойство(Колонка.имя);
            НовыйЭлемент = ЭтаФорма.Элементы.Добавить(ИмяТЗ+Колонка.Имя, Тип("ПолеФормы"), эТаблица);
            НовыйЭлемент.ПутьКДанным = ИмяТЗ + "." + Колонка.Имя;
            Если Колонка.Имя = "Выб" Тогда
                НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
            Иначе
                НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода;
                НовыйЭлемент.КнопкаОчистки 			= Ложь;
                НовыйЭлемент.КнопкаВыбора 			= Ложь;
                НовыйЭлемент.РедактированиеТекста 	= Ложь;
                НовыйЭлемент.КнопкаОткрытия 		= Истина;
				НовыйЭлемент.Видимость				= Видимость;
				НовыйЭлемент.ТолькоПросмотр			= Истина;
				Если Видимость Тогда
					НовыйЭлемент.Заголовок = ПараетрыТаблицы.Колонки[Колонка.имя]	
				КонецЕсли; 
            КонецЕсли;
        КонецЦикла;
        
        ЭтаФорма.ЗначениеВРеквизитФормы(ПараетрыТаблицы.Таблица, ИмяТЗ);	
		
		Если эТаблица <> Неопределено Тогда
			Для каждого элемКоманды из ПараетрыТаблицы.Команды Цикл
				сп_Интерфейс.СоздатьКоманду(элемКоманды, ЭтаФорма ,эТаблица.КоманднаяПанель);
			КонецЦикла;	
			Для каждого элемСобытие из ПараетрыТаблицы.События Цикл
				эТаблица.УстановитьДействие(элемСобытие.Ключ, элемСобытие.Значение)
			КонецЦикла;	
			
			
		КонецЕсли;
	
		
		
	Возврат эТаблица;
КонецФункции


Процедура СоздатьКоманду(параметрыКоманды, ЭтаФорма,  Родитель = Неопределено) Экспорт
	имяКоманды 		 = параметрыКоманды.Ключ;
	заголовокКоманды = параметрыКоманды.Значение;
	
	Если ЭтаФорма.Команды.Найти(имяКоманды)=Неопределено Тогда
		Командаформы 			= ЭтаФорма.Команды.Добавить(имяКоманды);
		Командаформы.Действие 	= имяКоманды;
		Командаформы.Заголовок 	= заголовокКоманды;
	КонецЕсли;		
	НовыйЭлемент 			= ЭтаФорма.Элементы.Добавить(ИмяКоманды, Тип("КнопкаФормы"), Родитель );
	НовыйЭлемент.ИмяКоманды = имяКоманды;
	НовыйЭлемент.Заголовок 	= заголовокКоманды;

КонецПроцедуры



Процедура СоздатьТаблицуОтчета2(ТЗ, ИмяСписка, ЭтаФорма) Экспорт
	
	
	МассивТипаВыбора 		= Новый Массив;
	МассивТипаВыбора.Добавить(Тип("ТаблицаЗначений"));
	ОписаниеТипаВыбора 		= Новый ОписаниеТипов(МассивТипаВыбора);
	
	МассивРеквизитов 	= Новый Массив;
	ИмяТЗ 				= "ТаблицаОтчета";
	ЗаголовокТЗ 		= "Отчет";
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяТЗ, ОписаниеТипаВыбора, "", ЗаголовокТЗ));	
	Для Каждого Колонка Из ТЗ.Колонки Цикл
		ТипыЗначений = Новый Массив;
		Для Каждого тТип Из Колонка.ТипЗначения.Типы() Цикл
			Если тТип <> Тип("Null") Тогда
				ТипыЗначений.Добавить(тТип);
			КонецЕсли;
		КонецЦикла;

		МассивРеквизитов.Добавить(Новый РеквизитФормы(Колонка.Имя, Новый ОписаниеТипов(ТипыЗначений), ИмяТЗ));
	КонецЦикла;
	
	Попытка
	    РеквизитыДляУдаления = Новый Массив;
		РеквизитыДляУдаления.Добавить(ИмяТЗ);
		ЭтаФорма.ИзменитьРеквизиты(,РеквизитыДляУдаления);	
	Исключение
		а = 1;
	КонецПопытки;

    ЭтаФорма.ИзменитьРеквизиты(МассивРеквизитов);
	эТаблица 							= ЭтаФорма.Элементы.Добавить(ЗаголовокТЗ, Тип("ТаблицаФормы"), ЭтаФорма.Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаОшибкиРасшифровка);
	эТаблица.ПутьКДанным 				= ИмяТЗ;
	эТаблица.Отображение 				= ОтображениеТаблицы.Список;
	эТаблица.ПоложениеКоманднойПанели 	= ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	эТаблица.ИзменятьСоставСтрок 		= Ложь;   	
	
	
        Для Каждого Колонка Из ТЗ.Колонки Цикл
            НовыйЭлемент = ЭтаФорма.Элементы.Добавить(Колонка.Имя, Тип("ПолеФормы"), эТаблица);
            НовыйЭлемент.ПутьКДанным = ИмяТЗ + "." + Колонка.Имя;
            Если Колонка.Имя = "Выб" Тогда
                НовыйЭлемент.Вид = ВидПоляФормы.ПолеФлажка;
            Иначе
                НовыйЭлемент.Вид 					= ВидПоляФормы.ПолеВвода;
                НовыйЭлемент.КнопкаОчистки 			= Ложь;
                НовыйЭлемент.КнопкаВыбора 			= Ложь;
                НовыйЭлемент.РедактированиеТекста 	= Ложь;
                НовыйЭлемент.КнопкаОткрытия 		= Истина;
            КонецЕсли;
        КонецЦикла;
        
        ЭтаФорма.ЗначениеВРеквизитФормы(ТЗ, ИмяТЗ);	
	
КонецПроцедуры

