
&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры


Процедура ЗаполнитьНаСервере()
	док = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.СинхронизацияСправочников"));
	док.ЗаполнитьПеродыЗагрузки();
	ЗначениеВДанныеФормы(док, объект);
КонецПроцедуры

&НаСервере
Процедура выполнитьОбменНаСервере()
	док = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.СинхронизацияСправочников"));
	док.ЗагрузитьСправочники();
	ЗначениеВДанныеФормы(док, объект)
КонецПроцедуры

&НаКлиенте
Процедура выполнитьОбмен(Команда)
	выполнитьОбменНаСервере();
КонецПроцедуры


&НаКлиенте
Процедура ПросмотрXML(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	хмл_incomes=ПросмотрXMLНаСервере();
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры


&НаСервере
Функция  ПросмотрXMLНаСервере()
	
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.СинхронизацияСправочников"));
	Возврат СтоСПОбмен_Запрос.ВыгрузкаПоступлений_income(об);
КонецФункции

