#Область Раз
Процедура Запустить_Выгрузку_100СП() экспорт
	
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();	
	
	
	НачатьТранзакцию();
	БлокировкаДанных 			= Новый БлокировкаДанных;
	ЭлементБлокировки 			= БлокировкаДанных.Добавить("Константа.ДатаПоследнейВыгрузки");
	ЭлементБлокировки.Режим 	= РежимБлокировкиДанных.Исключительный;
	Попытка
		БлокировкаДанных.Заблокировать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Выгрузка уже запущена в другом сеансе");
	КонецПопытки;
	
	Константы.ДатаПоследнейВыгрузки.Установить(ТекущаяДата());
	сек = 3;
	КонДата = ТекущаяДата() + сек;
  	Пока ТекущаяДата() < КонДата Цикл
      // ждемссс....
  	КонецЦикла;
	
	
	
	пакет				= Документы.Выгрузка_100СП.СоздатьДокумент();
	пакет.Дата			= ТекущаяДата();
	ОбъектовКВыгрузке	= пакет.ЗаполнитьНеОтправленными();
	
	Если ОбъектовКВыгрузке=0 Тогда Возврат КонецЕсли;
	пакет.Записать(РежимЗаписиДокумента.Запись);
	//пакет.СкомпоноватьДляВыгрузки();
	пакет.ВыгрузитьНаСайт();
	ЗафиксироватьТранзакцию();
	Если пакет.Статус=Перечисления.СтатусОтпавкиНаСайт.Отправлен Тогда
		Попытка
		    Пакет.Записать(РежимЗаписиДокумента.Проведение);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен100СП.ЗаписьПакета",УровеньЖурналаРегистрации.Ошибка,пакет,,
										ОписаниеОшибки());
		КонецПопытки;
	Иначе	
		Попытка
			пакет.Статус=Перечисления.СтатусОтпавкиНаСайт.Сформирован;
		    Пакет.Записать(РежимЗаписиДокумента.Запись);
		Исключение
			ЗаписьЖурналаРегистрации("Обмен100СП.ЗаписьПакета",УровеньЖурналаРегистрации.Ошибка,пакет,,
										ОписаниеОшибки());
		КонецПопытки;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
