функция sign(параметрыУРЛ) 
	хэш = новый ХешированиеДанных(ХешФункция.MD5);	
	хэш.Добавить(параметрыУРЛ); 
	возврат хэш.ХешСумма;	

КонецФункции




Функция ПолучитьТокен() Экспорт     
	сервер =   "check.business.ru";  
	ресурс =   "open-api/v2";
	
	appid = "b9ec565d-56b0-4190-800b-da7bd60890eb";
	nonce = новый УникальныйИдентификатор;
//	nonce = "d6baca2e-92cb-4450-aa5d-727ca3b53117";
	nonce = Строка(nonce); 
	
	структураПараметров = новый Структура;
	структураПараметров.Вставить("app_id",appid);
	структураПараметров.Вставить("nonce",nonce);
	
	стр = ПолучтиьПараметры(структураПараметров);
	
	ПараметрыУРЛ = стр.ПараметрыУРЛ;
	sign = стр.sign;
		
	ССЛ=Новый ЗащищенноеСоединениеOpenSSL;
	НТТР = Новый HTTPСоединение(Сервер,,,,,,ССЛ);
	HTTPЗапрос = Новый HTTPЗапрос();   
	
	
	Заголовки = новый Соответствие;	
	Заголовки.Вставить("Content-Type", "application/json");
	Заголовки.Вставить("sign",sign);	
	HTTPЗапрос.АдресРесурса = ресурс+"/Token?"+ПараметрыУРЛ;
	HTTPЗапрос.Заголовки = Заголовки;	
	Ответ = НТТР.Получить(HTTPЗапрос);
	
	тело = Ответ.ПолучитьТелоКакСтроку();        
	//{"expires":86400,"token":"25ee7095-9473-4e58-a1b8-e4f8382962b9"}   
	//{"expires":86400,"token":"0d3870c1-e637-4c8b-89b3-923a9cea1038"}       
	//{"expires":86400,"token":"0d3870c1-e637-4c8b-89b3-923a9cea1038"}
КонецФункции	 



Функция ПолучтиьПараметры(структураПараметров) 	
	secret = "QhpviJ4SDaNFZ8W9OG2AVTHeRyrMPEu6";
	ПараметрыУРЛ = "";
	Разделитель = "";
	ЗаписьJSON = новый ЗаписьJSON;	
	
	параметрызаписи = новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	ЗаписьJSON.ПроверятьСтруктуру = Истина;
	ЗаписьJSON.УстановитьСтроку(параметрызаписи);   
	ЗаписатьJSON(ЗаписьJSON, структураПараметров);
	строкаJSON = ЗаписьJSON.Закрыть();
	Для каждого парам из структураПараметров Цикл
		ПараметрыУРЛ = ПараметрыУРЛ + Разделитель+парам.Ключ+"="+парам.Значение;
		Разделитель = "&";            
	КонецЦикла;	                       
	

	
	//ПараметрыУРЛ   =  "{""app_id"":""b9ec565d-56b0-4190-800b-da7bd60890eb"",""nonce"":""32ad08be-082e-41fa-b1d1-eb4e215e6097""}";

	хэш = новый ХешированиеДанных(ХешФункция.MD5);	
	хэш.Добавить(строкаJSON + secret); 
	sign =  хэш.ХешСумма;	
	sign = НРег(СтрЗаменить(sign," ",""));
	
	//хэш1 = новый ХешированиеДанных(ХешФункция.MD5);	
	//строкаJSON1 ="{""app_id"":""b9ec565d-56b0-4190-800b-da7bd60890eb"",""nonce"":""d6baca2e-92cb-4450-aa5d-727ca3b53117""}"; 
	//хэш1.Добавить(строкаJSON1 + secret); 
	//sign1 =  хэш.ХешСумма;	
	
	
	
	Возврат новый Структура("ПараметрыУРЛ, sign",ПараметрыУРЛ, sign);
КонецФункции	