Процедура ЗаполнитьЗаказы() Экспорт
	Если ЗначениеЗаполнено(Ссылка) Тогда
		 ДатаОстатков = новый Граница(МоментВремени(),ВидГраницы.Исключая);
	Иначе	
		ДатаОстатков = ТекущаяДата();		
	КонецЕсли;	                       
    Заказы.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗаказыТранспортныхКомпанийОстатки.Заказ КАК Заказ,
		|	ЗаказыТранспортныхКомпанийОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ЗаказыТранспортныхКомпаний.Остатки(&ДатаОстатков, ТранспортнаяКомпания = &ТранспортнаяКомпания) КАК ЗаказыТранспортныхКомпанийОстатки";
	
	Запрос.УстановитьПараметр("ДатаОстатков", ДатаОстатков);
	Запрос.УстановитьПараметр("ТранспортнаяКомпания", Справочники.ТранспортныеКомпании.ПочтаРоссии);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		новаяСтрока = Заказы.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)     
	ТранспортнаяКомпания = Справочники.ТранспортныеКомпании.ПочтаРоссии;
	Движения.ЗаказыТранспортныхКомпаний.Записывать = Истина;
	Движения.ЗаказыТранспортныхКомпаний.Записать();
	
	
	Блокировака = новый БлокировкаДанных;
	элемент = Блокировака.Добавить("РегистрНакопления.ЗаказыТранспортныхКомпаний");
	элемент.УстановитьЗначение("ТранспортнаяКомпания", ТранспортнаяКомпания);
	элемент.ИсточникДанных = Заказы;
	элемент.ИспользоватьИзИсточникаДанных("Заказ", "Заказ");
	элемент.Режим = РежимБлокировкиДанных.Исключительный;
	Блокировака.Заблокировать();
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПередачаЗаказовПочтаРоссииЗаказы.Заказ КАК Заказ,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПередачаЗаказовПочтаРоссииЗаказы.Количество) КАК Количество
		|ПОМЕСТИТЬ втЗаказы
		|ИЗ
		|	Документ.ПередачаЗаказовПочтаРоссии.Заказы КАК ПередачаЗаказовПочтаРоссииЗаказы
		|ГДЕ
		|	ПередачаЗаказовПочтаРоссииЗаказы.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	ПередачаЗаказовПочтаРоссииЗаказы.Заказ
		|
		|ИНДЕКСИРОВАТЬ ПО
		|	Заказ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаказыТранспортныхКомпанийОстатки.Заказ КАК Заказ,
		|	ЕСТЬNULL(ЗаказыТранспортныхКомпанийОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ЗаказыТранспортныхКомпанийОстатки.СуммаОстаток, 0) КАК СуммаОстаток,
		|	втЗаказы.Количество КАК Количество
		|ИЗ
		|	втЗаказы КАК втЗаказы
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ЗаказыТранспортныхКомпаний.Остатки(
		|				&МоментВремени,
		|				ТранспортнаяКомпания = &ТранспортнаяКомпания
		|					И Заказ В
		|						(ВЫБРАТЬ
		|							втЗаказы.Заказ КАК Заказ
		|						ИЗ
		|							втЗаказы КАК втЗаказы)) КАК ЗаказыТранспортныхКомпанийОстатки
		|		ПО втЗаказы.Заказ = ЗаказыТранспортныхКомпанийОстатки.Заказ";
	
	
	Запрос.УстановитьПараметр("ТранспортнаяКомпания", ТранспортнаяКомпания);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если  Выборка.Количество > Выборка.КоличествоОстаток Тогда
			Отказ = Истина;                                       
		ИначеЕсли  Выборка.Количество = Выборка.КоличествоОстаток Тогда	
			СуммаКСписаднию = Выборка.СуммаОстаток;
		Иначе
			СуммаКСписаднию =  ВЫборка.Количество * Выборка.СуммаОстаток / Выборка.КоличествоОстаток;			
		КонецЕсли;                                                                                  
		Если Отказ = Истина Тогда 
			Продолжить;	
		КонецЕсли;	
		Движение = Движения.ЗаказыТранспортныхКомпаний.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Заказ = Выборка.Заказ;
		Движение.ТранспортнаяКомпания = ТранспортнаяКомпания;
		Движение.Количество = Выборка.Количество;
		Движение.Сумма = СуммаКСписаднию;
		
	КонецЦикла;
	
КонецПроцедуры
