
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКомандыФ, ПараметрыВыполненияКоманды)
	
	Если ПараметрКомандыФ.Количество()>0 и
		ТипЗнч(ПараметрКомандыФ[0]) = Тип("ДокументСсылка.СинхронизацияТарифов") Тогда
		
		массивОбъектов = новый Массив;
		Для каждого элем из ПараметрыВыполненияКоманды.Источник.Элементы.Тарифы.ВыделенныеСтроки цикл
			массивОбъектов.Добавить(ПараметрыВыполненияКоманды.Источник.Объект.Тарифы[элем].Габарит);
		КонецЦикла;
		ПараметрКоманды = массивОбъектов;
		
	Иначе
	    ПараметрКоманды = ПараметрКомандыФ;
	КонецЕсли;
	форма=ПолучитьФорму("Обработка.ПечатьСправочников.Форма");
	ДанныеФормы = Форма.Объект;
	ПечатьГрупповыхСтикеров(ПараметрКоманды,ДанныеФормы);
	КопироватьДанныеФормы(ДанныеФормы, Форма.Объект);
	
	ПараметрКоманды = Новый Массив;   // Добавим объект обработки печати ценников и этикеток в массив параметров печати.
	ПараметрКоманды.Добавить(Форма.Объект); // В дальнейшем будем обращаться к объекту через ПараметрКоманды[0]
	РежимПечати = "Этикетки";
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
	"Обработка.ПечатьСправочников", // Для вызова метода менеджера обработки "Печать".
	РежимПечати,
	ПараметрКоманды,
	, // Форма владелец
	//Новый Структура("Шаблон", Шаблон));
	);
КонецПроцедуры



&НаСервере
Процедура   ПечатьГрупповыхСтикеров(ПараметрКоманды,ДанныеФормы)
	Объект=ДанныеФормыВЗначение(ДанныеФормы,Тип("ОбработкаОбъект.ПечатьСправочников"));
	Объект.ЗаполнитьЭлементами(ПараметрКоманды);
	ЗначениеВДанныеФормы(Объект,ДанныеФормы);
КонецПроцедуры

Функция ПолучитьШаблонНаСервере()
	Возврат Константы.ШаблонПечатиГрупповыхСтикеров.Получить();
КонецФункции	
