

&НаКлиенте
Процедура СегментПриИзменении(Элемент)
	
	ЗаполнитьПунктыВыдачиПоСегменту(Сегмент);  
	УстановитьПараметрыНакладных();
	УстановитьВидимость();	
	
КонецПроцедуры 


&НаКлиенте
Процедура УстановитьВидимость()
	элементы.Накладные.Видимость = ЗначениеЗаполнено(Сегмент);
КонецПроцедуры 




Процедура ЗаполнитьПунктыВыдачиПоСегменту(Сегмент)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СегментыПунктовВыдачиПунктыВыдачи.ПунктВыдачи КАК ПунктВыдачи,
		|	ИСТИНА КАК Подбор
		|ИЗ
		|	Справочник.СегментыПунктовВыдачи.ПунктыВыдачи КАК СегментыПунктовВыдачиПунктыВыдачи
		|ГДЕ
		|	СегментыПунктовВыдачиПунктыВыдачи.Ссылка = &Ссылка";
	Запрос.Параметры.Вставить("Ссылка", Сегмент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		новаяСтрока = ПунктыВыдачи.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, ВыборкаДетальныеЗаписи);
	КонецЦикла;
КонецПроцедуры	

&НаКлиенте
Процедура ПередатьКурьеру(Команда)
	ПередатьКурьеруНаСервере();
	Элементы.Накладные.Обновить();
КонецПроцедуры


Процедура ПередатьКурьеруНаСервере()                                                                                                 
	ЭтоЗаморозка = Ложь;
	ДатаДокумента = ТекущаяДата();
	Для каждого элем из ПунктыВыдачи Цикл
		если не элем.подбор Тогда Продолжить; КонецЕсли;
		объект_ВыдачаТранзита = Документы.ВыдачаТранзита.СоздатьДокумент();
		объект_ВыдачаТранзита.Комментарий = "по сегменту "+сегмент;
		объект_ВыдачаТранзита.Дата = ДатаДокумента;   
		объект_ВыдачаТранзита.ТочкаОтправитель = Константы.СвояТочка.Получить();
		объект_ВыдачаТранзита.ЗаполнитьПоТочкеНазначения(,?(Параметры.Свойство("ТочкаНазначения"),Элем.ПунктВыдачи,Элем.ПунктВыдачи),ЭтоЗаморозка);		
		Если объект_ВыдачаТранзита.Покупки.Количество() = 0 Тогда		
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Для пункта выдачи: "+Элем.ПунктВыдачи + ", нет остатков на складе. Документ не сформирован.");			
		Иначе	
			объект_ВыдачаТранзита.Записать(РежимЗаписиДокумента.Проведение);		
		КонецЕсли;	
	КонецЦикла
КонецПроцедуры




Процедура УстановитьПараметрыНакладных()
	
	списокПВ = Новый СписокЗначений;
	Для каждого элем из ПунктыВыдачи Цикл
		если не элем.подбор Тогда Продолжить; КонецЕсли;
		списокПВ.Добавить(элем.ПунктВыдачи);	
	КонецЦикла;
	Накладные.Параметры.УстановитьЗначениеПараметра("Дата", НачалоДня(ТекущаяДата()));	
	Накладные.Параметры.УстановитьЗначениеПараметра("ТочкиНазначения", списокПВ);	
	
КонецПроцедуры	

&НаКлиенте
Процедура ПунктыВыдачиПриИзменении(Элемент)
	УстановитьПараметрыНакладных();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПараметрыРазмещения = ПодключаемыеКоманды.ПараметрыРазмещения(); 
	
	Массив = новый Массив;
	Массив.Добавить(Тип("ДокументСсылка.ВыдачаТранзита"));
	источники = новый ОписаниеТипов(Массив);
	
	ПараметрыРазмещения.Источники = источники;   
	ПараметрыРазмещения.ПрефиксГрупп = "";
	ПараметрыРазмещения.КоманднаяПанель = Элементы.Накладные.КоманднаяПанель;
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект, ПараметрыРазмещения);
КонецПроцедуры

&НаКлиенте
Процедура НакладныеПриАктивизацииСтроки(Элемент)
	    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды

КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Накладные);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Накладные, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Накладные);
КонецПроцедуры

// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


