
&НаКлиенте
Процедура ОбновитьССаййта(Команда)
	ОбновитьССаййтаНаСервере();
	ОбновитьОтображениеДанных(); 
	ОповеститьОбИзменении(Объект.Ссылка);
КонецПроцедуры

Процедура ОбновитьССаййтаНаСервере()
	СтоСПОбмен_Посылки.Загрузить_СоставПосылкиПоКодам(Объект.Код);
	Прочитать();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьМегаордер(Команда)
	ЗаполнитьМегаордерНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьМегаордерНаСервере()
	Если ЗначениеЗаполнено(Объект.Ссылка) и не ЗначениеЗаполнено(Объект.ШК) Тогда
		объект.ШК = СП_Штрихкоды.ПолучитьМегаордер(Объект.Ссылка,Объект.Участник ,Объект.ПунктВыдачи );
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ИсторияДоставки(Команда)
	ОткрытьФорму(	"Отчет.ИсторияЗаказов.Форма.ФормаОтчета",
					новый структура("мегаордер, СформироватьПриОткрытии",Объект.ШК, истина),
					ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

