
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Параметры.Супергруппа) Тогда
		Объект.ДокументОснование=Параметры.Супергруппа.Супергруппа.Покупка;
		ЗаполнитьЗначенияСвойств(Объект,Параметры.Супергруппа);
	КонецЕсли;
	Если Объект.Супергруппа.ПерваяТочка<>Константы.СвояТочка.Получить() Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Редактировать Супергруппу может только точка: "+Объект.Супергруппа.ПерваяТочка,,,,Отказ);
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("ОбновитьФорму");
КонецПроцедуры
