&НаКлиенте
Процедура ВыборФайла(Элемент,Расширение)
	
	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	
	ДиалогВыбораФайла.Фильтр                      = "Файл данных (*."+Расширение+")|*."+Расширение;
	ДиалогВыбораФайла.Заголовок                   = "Выберите файл";
	ДиалогВыбораФайла.ПредварительныйПросмотр     = Ложь;
	ДиалогВыбораФайла.Расширение                  = Расширение;
	ДиалогВыбораФайла.ИндексФильтра               = 0;
	ДиалогВыбораФайла.ПолноеИмяФайла              = Элемент.ТекстРедактирования;
	ДиалогВыбораФайла.ПроверятьСуществованиеФайла = Истина;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтотОбъект,Элемент.Имя);
	ДиалогВыбораФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры


&НаКлиенте
Процедура ВыборФайлаЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы <> Неопределено
		И ВыбранныеФайлы.Количество()>0 Тогда
		Объект[ДополнительныеПараметры] = ВыбранныеФайлы[0];
	КонецЕсли;
	
КонецПроцедуры



&НаКлиенте
Процедура ФайлCfНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла(Элемент,"cf");
КонецПроцедуры

&НаКлиенте
Процедура ФайлCfuНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ВыборФайла(Элемент,"cfu");
КонецПроцедуры


&НаКлиенте
Процедура УстановитьОбновление(Команда)
	
	СП_Обновление.УстановитьОбновление(ЭтотОбъект, Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Элементы.УстановитьОбновление.Доступность  = (РольДоступна("ОбновлениеКонфигурацииБазыДанных"));
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьСеансы(Команда)
	СП_COM_Коннектор.ЗавершитьВсеСеансыКромеТекущего();
КонецПроцедуры









