

&НаКлиенте
Процедура Применить(Команда)
	Если не ЗначениеЗаполнено(СокрЛП(Комментарий)) Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Необходимо заполнить комментарий");
		Возврат;
	КонецЕсли;
	
	Закрыть(Новый структура("ВопросРешен, Комментарий", ВопросРешен, СокрЛП(Комментарий)));
	
	 
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВопросРешен = параметры.вопросРешен;
	Комментарий	= параметры.Комментарий;
	Посылка		= параметры.Посылка;
	Коробка		= параметры.Коробка;
	
	Элементы.ГруппаЗаказ.Видимость = не Параметры.ГруппаЗаказов;
	
КонецПроцедуры





Процедура УстановитьВидимость()
	
	
КонецПроцедуры	

&НаКлиенте
Процедура ВыбратьКомментарий(Команда)
	ОпопвещениеЗакрытия= Новый ОписаниеОповещения("ЗавершениеВыбораШАблона", ЭтотОбъект);
	ОткрытьФорму("Справочник.Шаблоны.ФормаВыбора",,ЭтаФорма,,,,ОпопвещениеЗакрытия,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца)
КонецПроцедуры


Процедура ЗавершениеВыбораШАблона(Результат, ДополнительныеПараметры) Экспорт
	Комментарий = Результат;
	
КонецПроцедуры	