
Процедура Печать(ТабДок, Ссылка) Экспорт
	//{{_КОНСТРУКТОР_ПЕЧАТИ(Печать)
	
	ВнешняяКомпонента = Обработки.ПечатьЭтикетокИЦенников.ПодключитьВнешнююКомпонентуПечатиШтрихкода(); 
	Макет = Справочники.Номенклатура.ПолучитьМакет("ШК");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Габариты.Код,
	|	Габариты.Наименование
	|ИЗ
	|	Справочник.Габариты КАК Габариты
	|ГДЕ
	|	Габариты.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Область = Макет.ПолучитьОбласть("Шапка");
	ТабДок.Очистить();
	
	
	
	Пока Выборка.Следующий() Цикл
		
		ОбластьШК=Область.Области.Шапка;
		РисунокШтрихкод=Область.Рисунки.РисунокШтрихкод;
		//РисунокШтрихкод.Объект.ТипКода = ТипШтрихкода;
		
		
		
		ПараметрыШтрихкода=ЗаполнитьПараметрыОбработки("62"+Выборка.Код+"0");
		РисунокШтрихкод.Картинка = Обработки.ПечатьЭтикетокИЦенников.ПолучитьКартинкуШтрихкода(ВнешняяКомпонента, ПараметрыШтрихкода);
		РисунокШтрихкод.Расположить(ОбластьШК);
		
		
		
	//	рис.Объект.Сообщение=Выборка.Ссылка.Штрихкод;
		Область.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Область, Выборка.Уровень());
		
		
	КонецЦикла;
	
	

	//}}
КонецПроцедуры


Функция ЗаполнитьПараметрыОбработки(Код)
	ПараметрыШтрихкода=новый Структура;
	ПараметрыШтрихкода.Вставить("Ширина",50);
	ПараметрыШтрихкода.Вставить("Высота",30);
	ПараметрыШтрихкода.Вставить("ТипКода",1);
	ПараметрыШтрихкода.Вставить("ОтображатьТекст",истина);
	ПараметрыШтрихкода.Вставить("РазмерШрифта",12);
	ПараметрыШтрихкода.Вставить("Штрихкод","123456789101");
	ПараметрыШтрихкода.Штрихкод=Код;
	
	Возврат ПараметрыШтрихкода;	
	
КонецФункции	



Процедура ПеренумероватьГабариты() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Габариты.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Габариты КАК Габариты";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтарыйКОд = Выборка.Ссылка.Код;
		Попытка
		    НовыйКод = Число(СтарыйКОд)
		Исключение
			СтарыйКОд = СтрЗаменить(СтарыйКОд,"-","1");		
			НовыйКод = Число(СтарыйКОд);
		КонецПопытки;
		НовыйКод = Формат(НовыйКод,"ЧЦ=9; ЧВН=; ЧГ=0");
			
		габаритОбъект = выборка.ссылка.ПолучитьОбъект();	
		габаритОбъект.Код = НовыйКод;
		габаритОбъект.Записать();
		
		
		
	КонецЦикла;
	
	
	
КонецПроцедуры	

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
    Запрос = Новый Запрос;
    Запрос.Текст = 
        "ВЫБРАТЬ
        |    ТарифыСрезПоследних.Габарит как Ссылка
        |    ИЗ
        |    	РегистрСведений.Тарифы.СрезПоследних КАК ТарифыСрезПоследних
        |    ГДЕ
		|        ТарифыСрезПоследних.Габарит.Наименование  ПОДОБНО &Наименование и
        |    	НЕ ТарифыСрезПоследних.Отменен";
        
        
    Запрос.УстановитьПараметр("Наименование", Параметры.СтрокаПоиска + "%");
    
    РезультатЗапроса = Запрос.Выполнить();
    Таблица = РезультатЗапроса.Выгрузить();
    Массив = Таблица.ВыгрузитьКолонку("Ссылка");
    
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.ЗагрузитьЗначения(Массив);
    СтандартнаяОбработка = Ложь;
КонецПроцедуры
