
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Результат") Тогда
		Результат			= Параметры.Результат;
	КонецЕсли;
	Если Параметры.Свойство("Заголовок") Тогда
		ЭтаФорма.Заголовок	= Параметры.Заголовок;
	КонецЕсли;
	
	Если Параметры.Свойство("АдресРасшифровки") Тогда
		АдресРасшифровки	= Параметры.АдресРасшифровки;
	КонецЕсли;
	Если Параметры.Свойство("АдресХранилищаСКД") Тогда
		АдресХранилищаСКД	= Параметры.АдресХранилищаСКД;
	КонецЕсли;
	
	
	
	Если Параметры.Свойство("ДанныеРасшифровки") Тогда
		
		ДанныеРасшифровки 	= Параметры.ДанныеРасшифровки;
	КонецЕсли
	//Если Параметры.Супергруппа Тогда
	//	структураСверки = Документы.РазборКоробки.ПолучитьСверкуСупергруппы(Параметры);
	//	Результат		= структураСверки.Результат;
	//Иначе	
	//	структураСверки = Документы.РазборКоробки.ПолучитьСверкуКоробок(Параметры);
	//	Результат		= структураСверки.Результат;
	//КонецЕсли;	
КонецПроцедуры




&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	ПараметрВыполненогоДействия	=  Неопределено;
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("Организатор", "Организатор");
	//СтруктураДанных.Вставить("Менеджер", "Контрагент.ОсновнойМенеджерПокупателя");
	//СтруктураДанных.Вставить("ДоговорКонтрагента", "ДоговорКонтрагента");
	
	
	выпДействие		= ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет;
	  
	  
	  
	  ДоступныеДействия	= Новый Массив;      
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Отфильтровать);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Оформить);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Расшифровать);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Сгруппировать);
      ДоступныеДействия.Добавить(ДействиеОбработкиРасшифровкиКомпоновкиДанных.Упорядочить);
      
      ДополнительныеПункты	= новый СписокЗначений();
	
	
	
	
	СтандартнаяОбработка = Ложь;
	
	Если ЗначениеЗаполнено(АдресРасшифровки) и ЗначениеЗаполнено(АдресХранилищаСКД) Тогда
		ИсточникДоступныхНастроек 	= Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранилищаСКД);
		обрРасшифровки 		= Новый ОбработкаРасшифровкиКомпоновкиДанных(АдресРасшифровки, ИсточникДоступныхНастроек);
		
		Оповещение = Новый ОписаниеОповещения("РезультатОбработкаРасшифровки_Продолжение", ЭтаФорма, Расшифровка,
											"РезультатОбработкаРасшифровки_Ошибка",ЭтаФорма);
		обрРасшифровки.ПоказатьВыборДействия(Оповещение, Расшифровка, ДоступныеДействия, , Истина);

		
		
	Иначе  
		ЗначенияРасшифровки = ПолучитьДанныеРасшифровки(Расшифровка, СтруктураДанных);
		Если ЗначенияРасшифровки = неопределено Тогда Возврат; КонецЕсли;
		обрРасшифровки	= новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, ПараметрВыполненогоДействия);
		обрРасшифровки.ВыбратьДействие(Расшифровка, выпДействие ,ПараметрВыполненогоДействия,ДоступныеДействия,ДополнительныеПункты);
		
		Если выпДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.Нет Тогда
			
		ИначеЕсли выпДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда	
			ОткрытьЗначение(ПараметрВыполненогоДействия);
			
		КонецЕсли;	
		
	КонецЕсли;
	  
	  
	  
	  
      
	    
КонецПроцедуры



&НаКлиенте
Процедура РезультатОбработкаРасшифровки_Продолжение(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт
    Если ПараметрВыполненногоДействия <> Неопределено Тогда
        
		Если ВыполненноеДействие = ДействиеОбработкиРасшифровкиКомпоновкиДанных.ОткрытьЗначение Тогда
			//ОткрытьЗначение(ПараметрВыполненногоДействия);
            ПоказатьЗначение(,ПараметрВыполненногоДействия);
        КонецЕсли;
        
    КонецЕсли;        
КонецПроцедуры

&НаКлиенте
Процедура РезультатОбработкаРасшифровки_Ошибка(ВыполненноеДействие, ПараметрВыполненногоДействия, ДополнительныеПараметры) Экспорт
	
	                                 
КонецПроцедуры





&НаСервере
Функция ПолучитьДанныеРасшифровки(Расшифровка, СтруктураДанных)

      Данные_Расшифровки = ПолучитьИзВременногоХранилища(ДанныеРасшифровки);

      Если Данные_Расшифровки <> Неопределено Тогда
            Для каждого ЭлементДанных Из СтруктураДанных Цикл
                  Родитель = Данные_Расшифровки.Элементы[Расшифровка];
                  Пока Истина Цикл
                        МассивРодителей = Родитель.ПолучитьРодителей();
                        Если МассивРодителей.Количество() = 0 Тогда
                              Прервать;
                        КонецЕсли;
                        Родитель = Родитель.ПолучитьРодителей()[0];
                        Если ТипЗнч(Родитель) = Тип("ЭлементРасшифровкиКомпоновкиДанныхПоля") Тогда
                              Поле = Родитель.ПолучитьПоля().Найти(ЭлементДанных.Значение);
                              Если Поле <> Неопределено Тогда
                                    СтруктураДанных.Вставить(ЭлементДанных.Ключ, Поле.Значение);
                                    Прервать;
                              КонецЕсли;
                        КонецЕсли;
                  КонецЦикла;
            КонецЦикла;
      КонецЕсли;

      Возврат СтруктураДанных;

  КонецФункции 

