
&НаСервере
Процедура ВыгрузитьТариыфыНаСерверНаСервере()
	СтоСПОбмен_Тарифы.ВыгрузитьТарифыПоНаправлениямНаСервер(Объект);
КонецПроцедуры

&НаКлиенте
Процедура ВыгрузитьТариыфыНаСервер(Команда)
	ЗаписатьДокумент();
	ВыгрузитьТариыфыНаСерверНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьДокумент()
	Если не ЗначениеЗаполнено(Объект.Ссылка) или Модифицированность Тогда 
		СП_РаботаСДокументами_Клиент.ЗаписатьДокумент(ЭтаФорма);	
	КонецЕсли;
КонецПроцедуры






&НаСервере
Процедура ГруппаСтраницыПриСменеСтраницыНаСервере()
	Если Элементы.ГруппаСтраницы.ТекущаяСтраница	= Элементы.ГруппаСтраницы.ПодчиненныеЭлементы.ГруппаПротокол Тогда
		парамДок				= Протокол.Параметры.Элементы.Найти("Документ");
		парамДок.Значение		= Объект.Ссылка;
		парамДок.Использование	= Истина;
	Конецесли;	
КонецПроцедуры

&НаКлиенте
Процедура ГруппаСтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	ГруппаСтраницыПриСменеСтраницыНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		ЗаполнитьПоРегиструНаСервере();
	КонецЕсли;
	ТолькоПросмотр = Объект.Проведен;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПоРегиструНаСервере()
	док = ДанныеФормыВЗначение(Объект, Тип("ДокументОбъект.УстановкаТарифовПоНаравлениям"));
	док.ЗаполнитьПоРегистру();
	ЗначениеВДанныеФормы(Док,Объект);
	Модифицированность = Истина;
КонецПроцедуры


&НаСервере
Функция  ПросмотрXMLНаСервере()
	Возврат СтоСПОбмен_Запрос.ВыгрузитьТарифыПоНаправлениямсей_tariffsByDestination(объект.Ссылка);
КонецФункции



&НаКлиенте
Процедура ПросмотрXML(Команда)
	Если Модифицированность Тогда
		Записать(новый Структура("РежимЗаписи",РежимЗаписиДокумента.Запись));
	КонецЕсли;
	хмл_incomes=ПросмотрXMLНаСервере();
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры

&НаКлиенте
Процедура ПросмотрПолученногоXML(Команда)
	хмл_incomes = Элементы.Протокол.ТекущиеДанные.ПолученныеДанные;
	СтоСП_Клиент.Показать_XML(хмл_incomes);
КонецПроцедуры


&НаКлиенте
Процедура РазрешитьРедактирование(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаОжиданиеВводаШтрихкода",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодАдминистратора_Завершение", ЭтотОбъект),РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры


&НаКлиенте
Процедура ВвестиШтрихКодАдминистратора_Завершение(ШК, ДополнительныеПараметры) Экспорт
	Если ТипЗнч(ШК) =  Тип("Структура") и
		 ШК.Свойство("Администратор")	и
		 ШК.Администратор         			Тогда
		ТолькоПросмотр 									= Ложь;

	 КонецЕсли;	 
 КонецПроцедуры

&НаКлиенте
 Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	 Если Модифицированность Тогда
	 	ВыгрузитьТариыфыНаСерверНаСервере();
	КонецЕсли;	
 КонецПроцедуры
