Функция СписокУсастников(СтрокаПоиска,ПоискСНачалаСтроки,ПоискТочноеСоответствие,поИД) Экспорт   
	Параметры = Новый Структура;
	Параметры.Вставить("ПустойРезультата",Ложь);

	
	
	строкаТелефон   = СтрЗаменить(СтрокаПоиска," ","");
	строкаТелефон   = СтрЗаменить(строкаТелефон,"-","");
	строкаТелефон   = СтрЗаменить(строкаТелефон,"(","");
	строкаТелефон   = СтрЗаменить(строкаТелефон,")","");
	длинаТелефона 	= СтрДлина(строкаТелефон);
	Если СтрНачинаетсяС(строкаТелефон,"+7") Тогда
		строкаТелефон   = Прав(строкаТелефон,длинаТелефона-2); 
	Иначе
		строкаТелефон   = Прав(строкаТелефон,длинаТелефона-1); 
	КонецЕсли;	
	Попытка
		телЧисло   = Число(строкаТелефон);
		ПоискПоТелефону = Истина;
		строкаТелефон = "+7" + строкаТелефон;
	Исключение
		ПоискПоТелефону = Ложь;
	КонецПопытки;
	
	Запрос=Новый Запрос;
	Запрос.Текст= 
	 "ВЫБРАТЬ
	 |	Участники.Код КАК код,
	 |	Участники.Ссылка КАК Ссылка,
	 |	Участники.Ссылка.Наименование КАК Наименование,
	 |	Участники.Телефон1 КАК Телефон
	 |ПОМЕСТИТЬ втУчастники
	 |ИЗ
	 |	Справочник.Участники КАК Участники
	 |ГДЕ
	 |	ИСТИНА = ИСТИНА
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	Участники.Ссылка,
	 |	Участники.Ссылка.Наименование,
	 |	Участники.Код,
	 |	Участники.Телефон1
	 |
	 |ИНДЕКСИРОВАТЬ ПО
	 |	Ссылка
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	ОстаткиТоваровОстатки.Участник КАК Участник,
	 |	СУММА(ОстаткиТоваровОстатки.КоличествоОстаток) КАК Количество
	 |ПОМЕСТИТЬ втОстатки
	 |ИЗ
	 |	РегистрНакопления.ОстаткиТоваров.Остатки(
	 |			,
	 |			Участник В
	 |				(ВЫБРАТЬ
	 |					втУчастники.Ссылка КАК Ссылка
	 |				ИЗ
	 |					втУчастники КАК втУчастники)) КАК ОстаткиТоваровОстатки
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	ОстаткиТоваровОстатки.Участник
	 |;
	 |
	 |////////////////////////////////////////////////////////////////////////////////
	 |ВЫБРАТЬ
	 |	втУчастники.код КАК код,
	 |	втУчастники.Наименование КАК Наименование,
	 |	втУчастники.Ссылка КАК Ссылка,
	 |	втУчастники.Телефон КАК Телефон,
	 |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КартыУчастников.Ссылка) КАК КоличествоКарт,
	 |	СУММА(ЕСТЬNULL(втОстатки.Количество, 0)) КАК Количество
	 |ИЗ
	 |	втУчастники КАК втУчастники
	 |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КартыУчастников КАК КартыУчастников
	 |		ПО втУчастники.Ссылка = КартыУчастников.Владелец
	 |		ЛЕВОЕ СОЕДИНЕНИЕ втОстатки КАК втОстатки
	 |		ПО втУчастники.Ссылка = втОстатки.Участник
	 |
	 |СГРУППИРОВАТЬ ПО
	 |	втУчастники.Ссылка,
	 |	втУчастники.Наименование,
	 |	втУчастники.Телефон,
	 |	втУчастники.код
	 |
	 |УПОРЯДОЧИТЬ ПО
	 |	Количество УБЫВ";  
	
	УсловиеПоиска =  ?( не поИД,"
	|	Участники.Наименование ПОДОБНО &Поиск СПЕЦСИМВОЛ ""\"" ","
	|	Участники.Код = &Поиск ")+" "+?(ПоискПоТелефону," 
	|	или Участники.ТелефонХэш ПОДОБНО &хэшьТелефона СПЕЦСИМВОЛ ""\"" ","");

	Запрос.Текст=  СтрЗаменить(Запрос.Текст, "ИСТИНА = ИСТИНА",	УсловиеПоиска);
	ПоискСтр	= СтрЗаменить(СтрокаПоиска,	"%", "\%");
	ПоискСтр	= СтрЗаменить(ПоискСтр,	"_", "\_");
	ПоискСтр	= СтрЗаменить(ПоискСтр,	"[", "\[");
	Если не поИд тогда
		Запрос.УстановитьПараметр("Поиск", ?(ПоискТочноеСоответствие,ПоискСТР ,?(ПоискСНачалаСтроки,   ПоискСтр+"%","%"+ПоискСтр+"%")));
	Иначе
		Запрос.УстановитьПараметр("Поиск", Число(СтрокаПоиска));
	КонецЕсли;
	Если ПоискПоТелефону Тогда
		х				= новый ХешированиеДанных(ХешФункция.SHA256);
		х.Добавить(строкаТелефон);
		хэшьТелефона 	= НРег(СтрЗаменить(Строка(х.ХешСумма)," ",""));
		Запрос.УстановитьПараметр("хэшьТелефона",хэшьТелефона);
	КонецЕсли;
	
	Результат	= Запрос.Выполнить();     
	Параметры.Вставить("ПустойРезультата",Результат.Пустой());
	Параметры.Вставить("ПоискПоТелефону",ПоискПоТелефону);
	Параметры.Вставить("строкаТелефон",строкаТелефон);
	
	
	
	Возврат Новый Структура("РезультатЗапроса, Параметры, ПоискПоТелефону, хэшьТелефона", Результат, Параметры, ПоискПоТелефону, хэшьТелефона);
	
КонецФункции	