








Процедура  РасчитатьСтоимостьОтправления(ДокументОтправления) Экспорт
	если Ложь Тогда
		ДокументОтправления = Документы.ОтправлениеТранзита.СоздатьДокумент();
	КонецЕсли;	
	
	Параметры = Новый Структура;
	Параметры.Вставить("ДокументОтправления",	ДокументОтправления);  		
	
	Параметры.Вставить("ДатаДокумента",			ДокументОтправления.Дата);  		
	//Параметры.Вставить("ОбъявленнаяСтоимость",	ДокументОтправления.ОбъявленнаяСтоимость);  		
	Параметры.Вставить("ОбъявленнаяСтоимость",	0);  		
	Параметры.Вставить("Хрупкое",				ДокументОтправления.Хрупкое);
	Параметры.Вставить("ИндексОтправителя", 	ДокументОтправления.ИндексОтправителя);  	
	Параметры.Вставить("ИндексПолучателя", 		ДокументОтправления.Индекс);  	
	
	Параметры.Вставить("Тип", 					ДокументОтправления.тип);
	Параметры.Вставить("Вес", 					ДокументОтправления.вес);
	Параметры.Вставить("Высота", 				ДокументОтправления.Высота);
	Параметры.Вставить("Ширина", 				ДокументОтправления.ширина);
	Параметры.Вставить("Длина", 				ДокументОтправления.Длина);
	
	Если Параметры.Тип = "postMail" или Параметры.Тип = "ems" Тогда
		Параметры.Вставить("ЭтоEMS", 		   (ДокументОтправления.ТочкаНазначения = СП_РаботаСоСправочниками.ПолучитьПунктВыдачиПо_Коду("0021")));
		//Параметры.Вставить("КатегорияРПО", 		ДокументОтправления.КатегорияРПО);  	
		//Параметры.Вставить("ВидРПО", 			ДокументОтправления.ВидРПО);  	
		Параметры.Вставить("негабарит",			ДокументОтправления.негабарит);  
		МодульИнтеграции = Интеграция_ПочтаРоссии;
	ИначеЕсли Параметры.Тип = "boxberry" или Параметры.Тип = "boxberryCourier" Тогда
		Параметры.Вставить("КодПС",				ДокументОтправления.ПунктПриема.Код);			//ПунктСдачи	
		Параметры.Вставить("КодПВЗ",			ДокументОтправления.КодПВЗ);					//ПунктПолучения
		
		
		МодульИнтеграции = Интеграция_BoxBerry;
	ИначеЕсли Параметры.Тип = "sdec" или Параметры.Тип = "sdecCourier" или Параметры.Тип = "postamat" Тогда
		Параметры.Вставить("Логин",					ДокументОтправления.ТочкаНазначения.АккаунтДляОбменаСТК);
		Параметры.Вставить("Пароль",				ДокументОтправления.ТочкаНазначения.ПарольДляОбменаСТК);
		Параметры.Вставить("Тариф",					ДокументОтправления.Тариф.КодТарифа);
		Параметры.Вставить("КодГородаОтправителя",	ДокументОтправления.ГородОтправитель.Код);
		Параметры.Вставить("КодГородаПолучателя", 	ДокументОтправления.cityCode);
		Параметры.Вставить("ТяжелыйГруз", 			ДокументОтправления.ТяжелыйГруз);
		Параметры.Вставить("ТочкаНазначения",		ДокументОтправления.ТочкаНазначения);  		
        Параметры.Вставить("ДатаДокумента",			ТекущаяДата());  		
		МодульИнтеграции = Интеграция_СДЭК_в20;//ОбменДаннымиСДЭК;
	ИначеЕсли Параметры.Тип = "dpd" Тогда
		Параметры.Вставить("Город",				ДокументОтправления.Город);
		Параметры.Вставить("КодПВЗ",			ДокументОтправления.КодПВЗ);					//ПунктПолучения
		Параметры.Вставить("УслугаDPD",			ДокументОтправления.УслугаDPD);
		МодульИнтеграции = Интеграция_DPD;
	ИначеЕсли Параметры.Тип = "" Тогда
		
	Конецесли;		
	//Если Параметры.Тип = "sdec" или Параметры.Тип = "sdecCourier" Тогда
	//	ДокументОтправления.РасчетСтоимостиПоВсемТарифам = Истина;
	//	
	//	протокол   			=  МодульИнтеграции.РассчитатьСтоимостьВсеТарифы(Параметры);
	//	строка_Протокола 	=  ДокументОтправления.ПротоколыПередач.Добавить();
	//	ЗаполнитьЗначенияСвойств(строка_Протокола, протокол);
	//	
	//	МассивТарифов 	= протокол.МассивТарифов;
	//	ДокументОтправления.РасчетКалькулятораПочта.Очистить();
	//	
	//	Для Каждого элем Из МассивТарифов Цикл
	//		
	//		расчет = ДокументОтправления.РасчетКалькулятораПочта.Добавить();
	//		ЗаполнитьЗначенияСвойств(расчет, элем);
	//		НетРасчета = Истина;
	//		Если расчет.ТарифТК > 0 Тогда
	//			базаНалПлатеж				= расчет.ТарифТК + ДокументОтправления.ТарифПВнп + ДокументОтправления.ОбъявленнаяСтоимость * ДокументОтправления.ПроцентОС / 100;
	//			базаПредоплата				= расчет.ТарифТК + ДокументОтправления.ТарифПВ 	 + ДокументОтправления.ОбъявленнаяСтоимость * ДокументОтправления.ПроцентОС / 100;
	//			
	//			расчет.СтоимостьНалПлатеж	= Окр(базаНалПлатеж + базаНалПлатеж * ДокументОтправления.Процент / 100, 0);
	//			расчет.СтоимостьПредоплата	= Окр(базаПредоплата, 0);
	//			
	//			расчет.результат = ?(расчет.СтоимостьНалПлатеж<>0 или расчет.СтоимостьПредоплата<>0,"ok","error");
	//			ДокументОтправления.ИтогоСтоимость = 0;
	//			НетРасчета = Ложь;
	//			
	//		КонецЕсли;	
	//		
	//		Если НетРасчета Тогда
	//			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Стоимость не расчитана не по одному тарифу!")
	//		КонецЕсли;	
	//		
	//	КонецЦикла;
	//	
	//Иначе
		ДокументОтправления.РасчетСтоимостиПоВсемТарифам = Ложь;
		Протокол							=  МодульИнтеграции.РассчитатьСтоимость(Параметры);
		ДокументОтправления.СрокДоставки 	= Протокол.СрокДоставки;
		строка_Протокола 					= ДокументОтправления.ПротоколыПередач.Добавить();
		ЗаполнитьЗначенияСвойств(строка_Протокола, Протокол);
		Если Протокол.Результат = "error" Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Протокол.ТекстОшибки);
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(ДокументОтправления, Протокол,"ТарифТК, РасчетКалькулятора");
//КонецЕсли
КонецПроцедуры

Функция СформироватьЗаказ(ДокументОтправления) Экспорт
	если Ложь Тогда ДокументОтправления = Документы.ОтправлениеТранзита.СоздатьДокумент(); КонецЕсли;
	Параметры = новый Структура;
	Параметры.Вставить("Тип", 					ДокументОтправления.тип);
	Параметры.Вставить("Вес",					ДокументОтправления.Вес);
	Параметры.Вставить("Длина",					ДокументОтправления.Длина);
	Параметры.Вставить("Ширина",				ДокументОтправления.Ширина);
	Параметры.Вставить("Высота",				ДокументОтправления.Высота);
	Параметры.Вставить("Хрупкое",				ДокументОтправления.Хрупкое);
	//Параметры.Вставить("ОбъявленнаяСтоимость",	ДокументОтправления.ОбъявленнаяСтоимость);
	Параметры.Вставить("ОбъявленнаяСтоимость",	0);
	Параметры.Вставить("МетодОплаты",			ДокументОтправления.Коробка.МетодОплаты);
	Параметры.Вставить("ФИО",					ДокументОтправления.ФИО);
	Параметры.Вставить("КодПВЗ",				ДокументОтправления.КодПВЗ);                        //ПунктПолучения
	Параметры.Вставить("Телефон",				ДокументОтправления.Телефон);
	Параметры.Вставить("email",					ДокументОтправления.email);
	Параметры.Вставить("Город",					ДокументОтправления.Город);
	Параметры.Вставить("Индекс",				ДокументОтправления.Индекс);
	Параметры.Вставить("НомерЗаказа",			ДокументОтправления.Номер);							//Наш номер


	
	
	Если Параметры.Тип = "dpd" Тогда
		Параметры.Вставить("ДатаПриемаГруза",	ДокументОтправления.ДатаПриемаГруза);
		Параметры.Вставить("УслугаDPD",			ДокументОтправления.УслугаDPD);
		
		МодульИнтеграции = Интеграция_DPD;
	ИначеЕсли Параметры.Тип="boxberry" или Параметры.Тип="boxberryCourier" Тогда	
		Параметры.Вставить("ИтогоСтоимость",	ДокументОтправления.ИтогоСтоимость);			
		Параметры.Вставить("ТарифТК",			ДокументОтправления.ТарифТК);			
		Параметры.Вставить("КодПС",				ДокументОтправления.ПунктПриема.Код);			//ПунктСдачи	
		Параметры.Вставить("СоставЗаказа",		ДокументОтправления.Заказы.Выгрузить(,"НомерСтроки, Покупка, Количество"));
		Параметры.Вставить("Адрес",				ДокументОтправления.Адрес);			
		
		МодульИнтеграции = Интеграция_BoxBerry;
	ИначеЕсли Параметры.Тип="sdec"  или Параметры.Тип = "sdecCourier" или Параметры.Тип = "postamat"  Тогда	
		//Параметры.Вставить("ИтогоСтоимость",	ДокументОтправления.ИтогоСтоимость);			
		//Параметры.Вставить("ТарифТК",			ДокументОтправления.ТарифТК);			
		//Параметры.Вставить("КодПС",				ДокументОтправления.ПунктПриема.Код);			//ПунктСдачи	
		//Параметры.Вставить("СоставЗаказа",		ДокументОтправления.Заказы.Выгрузить(,"НомерСтроки, Покупка, Количество"));
		
		Параметры = ДокументОтправления;
		МодульИнтеграции =  Интеграция_СДЭК_в20;
		
	ИначеЕсли Параметры.Тип = "" Тогда
		
	Конецесли;	
	Протокол =  МодульИнтеграции.СозданиеЗаказаНаДоставку(Параметры);
	Если Протокол.Результат = "error" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Протокол.ТекстОшибки);
	КонецЕсли;
	
	Если Параметры.Тип="sdec"  или Параметры.Тип = "sdecCourier"  Тогда	
		
	Иначе	
		строка_Протокола = ДокументОтправления.ПротоколыПередач.Добавить();
		ЗаполнитьЗначенияСвойств(строка_Протокола, Протокол);
		
		Если Протокол.Свойство("ТрекНомер")  Тогда
			ДокументОтправления.НомерЗаказа	=	Протокол.ТрекНомер;
		КонецЕсли;	
	КонецЕсли;	
	Возврат Протокол;
КонецФункции	

Функция  ПолучитьНаклейки(СписокДокументовОтправления) экспорт
	Если ТипЗнч(СписокДокументовОтправления) = Тип("ДокументСсылка.ОтправлениеТранзита") или 
		 ТипЗнч(СписокДокументовОтправления) = Тип("ДокументОбъект.ОтправлениеТранзита")Тогда
		СписокДокументов = Новый СписокЗначений;
		СписокДокументов.Добавить(СписокДокументовОтправления);
	Иначе 	
		СписокДокументов = СписокДокументовОтправления;
	КонецЕсли;	
	
	тип = СписокДокументов[0].Значение.Тип;
	Если Тип = "dpd" тогда
		Возврат Интеграция_DPD.ПолучитьНаклейкиЗаказа(СписокДокументов);
	конецЕсли;
КонецФункции

Процедура УдалитьЗаказ(ДокументОтправления) Экспорт
	Параметры = новый Структура;
	Параметры.Вставить("Тип", 					ДокументОтправления.тип);

	Параметры.Вставить("НомерЗаказа",			ДокументОтправления.Номер);							//Наш номер
	Параметры.Вставить("НомерДПД",				ДокументОтправления.НомерЗаказа);							//Наш номер
	Если Параметры.Тип = "dpd" Тогда
		МодульИнтеграции = Интеграция_DPD;
	КонецЕсли;	
	Протокол =  МодульИнтеграции.УдалениеЗаказа(Параметры);
	строка_Протокола = ДокументОтправления.ПротоколыПередач.Добавить();
	ЗаполнитьЗначенияСвойств(строка_Протокола, Протокол);
	Если Протокол.Результат = "error" Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Протокол.ТекстОшибки);
	Иначе	
		ДокументОтправления.НомерЗаказа	=	"";	
	КонецЕсли;
	
КонецПроцедуры



Функция ПолучитьСтруктуруПротокола(ВидОбмена = "Стоимость") Экспорт
	Если ВидОбмена = "Стоимость" Тогда
		ВидОбмена = Перечисления.ВидыОбменовСДЭК.СтоимостьПоТарифу ;
	КонецЕсли;	
	протокол = новый Структура;
	протокол.Вставить("ДатаНачала",				ТекущаяДата());
	протокол.Вставить("ОтправленныеДанные",		"");
	протокол.Вставить("ПолученныеДанные",		"");
	протокол.Вставить("ВидОбмена",				ВидОбмена);
	протокол.Вставить("ТекстОшибки", 			"");
	протокол.Вставить("СрокДоставки", 			"");
	
	протокол.Вставить("ДатаОкончания");
	протокол.Вставить("Результат",				"");
	Если ВидОбмена = Перечисления.ВидыОбменовСДЭК.СтоимостьПоТарифу Тогда
		протокол.Вставить("ТарифТК",			 0);
		протокол.Вставить("РасчетКалькулятора",	"");
		протокол.Вставить("СрокДоставкиМин",     0);
		протокол.Вставить("СрокДоставкиМакс",    0);
	ИначеЕсли ВидОбмена = Перечисления.ВидыОбменовСДЭК.СозданиеЗаказаНаДоставку Тогда	
		протокол.Вставить("ТрекНомер",			"");
	ИначеЕсли ВидОбмена = Перечисления.ВидыОбменовСДЭК.ПолучитьКвитанцию Тогда		
		протокол.Вставить("Файл",			"");
		Протокол.Вставить("ТипФайла",		"");
	КонецЕсли;
	Возврат протокол;
КонецФункции	

//
//Получаем представление Отправленных данных, когда взаимодействуем через Web servis
//
Функция ПолучитьОтправляемыеДанные(Параметры) экспорт
	Текст = "";
	Если ТипЗнч(Параметры) = тип("СписокЗначений") Тогда
		Для каждого элем из Параметры цикл
			Текст = Текст +"Документ: "+Элем.Значение.Номер+" от "+Элем.Значение.Номер+", трек:"+Элем.Значение.НомерЗаказа+", гуппа:"+Элем.Значение.Коробка+"."+Символы.ПС;
		КонецЦикла;	
	Конецесли;	
	Если ТипЗнч(Параметры) = тип("Структура") Тогда
		Для каждого элем из Параметры цикл
			Текст = Текст + элем.Ключ+ ": "+Элем.Значение+", "+Символы.ПС;
		КонецЦикла;	
	КонецЕсли;
	Возврат Текст;
КонецФункции	

