
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("", );
	Оповещение = новый ОписаниеОповещения("ЗавершениеВыбораОплаты", ЭтотОбъект, ПараметрКоманды);
	ОткрытьФорму("Документ.Расходная.Форма.ВыборМетодаОплаты", , ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка,Оповещение);
КонецПроцедуры

&НаКлиенте
Процедура ЗавершениеВыбораОплаты(Результат, ДополнительныеПараметы) Экспорт
	
	ЗавершениеВыбораОплатыНаСервере(Результат, ДополнительныеПараметы);
КонецПроцедуры	


Процедура ЗавершениеВыбораОплатыНаСервере(Результат, ДополнительныеПараметы)
	Если ЗначениеЗаполнено(ДополнительныеПараметы) и ЗначениеЗаполнено(Результат) и
		ДополнительныеПараметы.ВидОплаты<> Результат Тогда
		об = ДополнительныеПараметы.ПолучитьОбъект();
		об.ВидОплаты = Результат;
		Если Результат = Перечисления.ФормыОплаты.ПлатежнаяКарта и не ЗначениеЗаполнено(об.НомерКарты) Тогда
		  	об.НомерКарты = ТекущаяДата();
		КонецЕсли;
		об.Записать();
	КонецЕсли;
КонецПроцедуры