
Функция ПолучитьТэг_Income_Посылки(Ссылка,НомерСтроки=Неопределено) Экспорт
	ОтборПоСсылке=?(ТипЗнч(Ссылка)=Тип("Массив"),"Данные.Ссылка 	 В (&Ссылка) ",		"Данные.Ссылка 		= &Ссылка ");
	ОтборПоСтроке=?(ТипЗнч(Ссылка)=Тип("Массив"),"Данные.НомерСтроки В (&НомерСтроки) ","Данные.НомерСтроки = &НомерСтроки ");
	
	УсловияОтбора = ОтборПоСсылке+" "+?(НомерСтроки=Неопределено,"", "И "+ОтборПоСтроке);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	     "ВЫБРАТЬ
	     |	Данные.НомерСтроки КАК НомерСтроки,
	     |	Данные.Заказ КАК Заказ,
	     |	Данные.ПунктВыдачиНаСтикере КАК ПунктВыдачи,
	     |	Данные.МестоХранения КАК МестоХранения,
	     |	Данные.Габарит КАК Габарит,
	     |	Данные.ДатаПриема КАК ДатаПриема,
	     |	Данные.Коробка КАК Коробка,
	     |	&СвояТочка КАК СвояТочка,
	     |	Данные.Партия.Дата КАК Дата,
	     |	Данные.ОтдельнымМестом КАК ОтдельнымМестом,
	     |	Данные.Партия.Номер КАК Номер,
	     |	Данные.Вес КАК Вес,
	     |	Данные.Объем КАК Объем,
	     |	Данные.КодТарифа КАК КодТарифа,
	     |	Данные.Негабарит КАК Негабарит,
	     |	Данные.НетДанных КАК НетДанных,
		 |	Выбор когда ТипЗначения(Данные.Партия) = Тип(Документ.РазборКоробки) и Данные.Партия.Контрагент <> Значение(Справочник.Контрагенты.ПустаяСсылка) Тогда
		 |		Истина
		 |	Иначе
		 |		Ложь
		 |	Конец КАК noPurchaseVisibilityDeliveryFee,
		 |	ВЫБОР
	     |		КОГДА Данные.ПунктВыдачиНаСтикере <> &СвояТочка
	     |			ТОГДА ИСТИНА
	     |		ИНАЧЕ ЛОЖЬ
	     |	КОНЕЦ КАК Транзит,
	     |	Данные.innerId КАК innerId
	     |ИЗ
	     |	Документ.СинхронизацияПоступлений.Данные КАК Данные
	     |ГДЕ
		 |	ТИПЗНАЧЕНИЯ(Данные.Партия) <> ТИП(Документ.ЗаказыДляТранзита) и
	     |	&УсловияОтбора
	     |
	     |УПОРЯДОЧИТЬ ПО
	     |	НомерСтроки";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбора", УсловияОтбора);
	Запрос.УстановитьПараметр("СвояТочка", 		Константы.СвояТочка.Получить());
	Запрос.УстановитьПараметр("НомерСтроки", 	НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат ""; КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();

	ЗаписьXML = новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("income");
		СтоСП.Вставить_Тэг(ЗаписьXML, "paid", 				1);
		СтоСП.Вставить_Тэг(ЗаписьXML, "date", 				?(ЗначениеЗаполнено(Выборка.ДатаПриема), Выборка.ДатаПриема, Выборка.Дата));
		СтоСП.Вставить_Тэг(ЗаписьXML, "sizedCategoryName", 	Выборка.МестоХранения.Наименование);
		СтоСП.Вставить_Тэг(ЗаписьXML, "arrivalNumber", 		Прав(Выборка.Номер, (СтрДлина(Выборка.Номер)- 3)));
		СтоСП.Вставить_Тэг(ЗаписьXML, "innerId", 			Формат(Число(Выборка.innerId),"ЧГ=0"));
			
		СтоСП.Вставить_Тэг(ЗаписьXML, "sizedCategoryNumber", СтоСП.ПолучитьПредставлениеГабарита(Выборка.Габарит));
		СтоСП.Вставить_Тэг(ЗаписьXML, "transit", 			?(Выборка.Транзит , 1, 0));
		Если Выборка.Транзит Тогда
			СтоСП.Вставить_Тэг(ЗаписьXML, "noPurchaseVisibilityDeliveryFee", ?(Выборка.noPurchaseVisibilityDeliveryFee , 1, 0));
		КонецЕсли;			
		СтоСП.Вставить_Тэг(ЗаписьXML,"tariffId",             Выборка.кодТарифа);
		Если Выборка.Негабарит Тогда
			СтоСП.Вставить_Тэг(ЗаписьXML,"kg",              Формат(Число(Выборка.Вес),"ЧГ=0" ));
			СтоСП.Вставить_Тэг(ЗаписьXML,"cube",            Формат(Число(Выборка.Объем),"ЧГ=0" ));
		КонецЕсли;

		СтоСП.Вставить_Тэг(ЗаписьXML, 						"isBig", ?(Выборка.НеГабарит, 1, 0));
		СтоСП.Вставить_Тэг(ЗаписьXML, 						"isFree", ?(Выборка.ОтдельнымМестом, 1, 0));
		СтоСП.Вставить_Тэг(ЗаписьXML, 						"DistributorFee", 0); //Орг сбор
		Если ТипЗнч(Выборка.Заказ) = Тип("СправочникСсылка.Посылки") Тогда
			Если не (Выборка.Коробка = Справочники.Коробки.БезКоробки или Выборка.Коробка = Справочники.Коробки.ПустаяСсылка() или Выборка.Коробка = Неопределено) Тогда
				СтоСП.Вставить_Тэг(ЗаписьXML, "groupCode", 	Формат(Число(Выборка.Коробка.Код), "ЧГ=0"));
			КонецЕсли;
			СтоСП.Вставить_Тэг(ЗаписьXML, "packageId", 		Формат(Выборка.Заказ.Код, "ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "orderType", 		"package");
		Иначе
			СтоСП.Вставить_Тэг(ЗаписьXML, "orgid", 	   		Формат(Число(Выборка.Заказ.Организатор.Код),"ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "groupCode", 		Формат(Выборка.Заказ.Код, "ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "orderType", 		"group");
		КонецЕсли;

		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	рез = ЗаписьXML.Закрыть();
	рез=СтрЗаменить(рез,"<Служебный>","");
	рез=СтрЗаменить(рез,"</Служебный>","");
	
	Возврат рез;
КонецФункции




Функция ПолучитьТэг_PreIncome_Посылки(Ссылка,НомерСтроки=Неопределено) Экспорт
	ОтборПоСсылке=?(ТипЗнч(Ссылка)=Тип("Массив"),"Данные.Ссылка 	 В (&Ссылка) ",		"Данные.Ссылка 		= &Ссылка ");
	ОтборПоСтроке=?(ТипЗнч(Ссылка)=Тип("Массив"),"Данные.НомерСтроки В (&НомерСтроки) ","Данные.НомерСтроки = &НомерСтроки ");
	
	УсловияОтбора = ОтборПоСсылке+" "+?(НомерСтроки=Неопределено,"", "И "+ОтборПоСтроке);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	     "ВЫБРАТЬ
	     |	Данные.НомерСтроки КАК НомерСтроки,
	     |	Данные.Заказ КАК Заказ,
	     |	Данные.ПунктВыдачиНаСтикере КАК ПунктВыдачи,
	     |	Данные.МестоХранения КАК МестоХранения,
	     |	Данные.Габарит КАК Габарит,
	     |	Данные.ДатаПриема КАК ДатаПриема,
	     |	Данные.Коробка КАК Коробка,
	     |	&СвояТочка КАК СвояТочка,
	     |	Данные.Партия.Дата КАК Дата,
	     |	Данные.ОтдельнымМестом КАК ОтдельнымМестом,
	     |	Данные.Партия.Номер КАК Номер,
	     |	Данные.Вес КАК Вес,
	     |	Данные.Объем КАК Объем,
	     |	Данные.КодТарифа КАК КодТарифа,
	     |	Данные.Негабарит КАК Негабарит,
	     |	Данные.НетДанных КАК НетДанных,
	     |	ВЫБОР
	     |		КОГДА Данные.ПунктВыдачиНаСтикере <> &СвояТочка
	     |			ТОГДА ИСТИНА
	     |		ИНАЧЕ ЛОЖЬ
	     |	КОНЕЦ КАК Транзит,
	     |	Данные.innerId КАК innerId
	     |ИЗ
	     |	Документ.СинхронизацияПоступлений.Данные КАК Данные
	     |ГДЕ
		 |	ТИПЗНАЧЕНИЯ(Данные.Партия) = ТИП(Документ.ЗаказыДляТранзита) и
	     |	&УсловияОтбора
	     |
	     |УПОРЯДОЧИТЬ ПО
	     |	НомерСтроки";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УсловияОтбора", УсловияОтбора);
	Запрос.УстановитьПараметр("СвояТочка", 		Константы.СвояТочка.Получить());
	Запрос.УстановитьПараметр("НомерСтроки", 	НомерСтроки);
	Запрос.УстановитьПараметр("Ссылка", 		Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат ""; КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();

	ЗаписьXML = новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("UTF-8");
	ЗаписьXML.ЗаписатьНачалоЭлемента("Служебный");
	Пока Выборка.Следующий() Цикл
		ЗаписьXML.ЗаписатьНачалоЭлемента("preIncome");
//		СтоСП.Вставить_Тэг(ЗаписьXML, "paid", 				1);
		СтоСП.Вставить_Тэг(ЗаписьXML, "date", 				?(ЗначениеЗаполнено(Выборка.ДатаПриема), Выборка.ДатаПриема, Выборка.Дата));
//		СтоСП.Вставить_Тэг(ЗаписьXML, "sizedCategoryName", 	Выборка.МестоХранения.Наименование);
		СтоСП.Вставить_Тэг(ЗаписьXML, "arrivalNumber", 		Прав(Выборка.Номер, (СтрДлина(Выборка.Номер)- 3)));
		СтоСП.Вставить_Тэг(ЗаписьXML, "innerId", 			Формат(Число(Выборка.innerId),"ЧГ=0"));
			
//		СтоСП.Вставить_Тэг(ЗаписьXML, "sizedCategoryNumber", СтоСП.ПолучитьПредставлениеГабарита(Выборка.Габарит));
		СтоСП.Вставить_Тэг(ЗаписьXML, "transit", 			?(Выборка.Транзит , 1, 0));
//		СтоСП.Вставить_Тэг(ЗаписьXML,"tariffId",             Выборка.кодТарифа);
		//Если Выборка.Негабарит Тогда
		//	СтоСП.Вставить_Тэг(ЗаписьXML,"kg",              Формат(Число(Выборка.Вес),"ЧГ=0" ));
		//	СтоСП.Вставить_Тэг(ЗаписьXML,"cube",            Формат(Число(Выборка.Объем),"ЧГ=0" ));
		//КонецЕсли;

		//СтоСП.Вставить_Тэг(ЗаписьXML, 						"isBig", ?(Выборка.НеГабарит, 1, 0));
		//СтоСП.Вставить_Тэг(ЗаписьXML, 						"isFree", ?(Выборка.ОтдельнымМестом, 1, 0));
//		СтоСП.Вставить_Тэг(ЗаписьXML, 						"DistributorFee", 0); //Орг сбор
		Если ТипЗнч(Выборка.Заказ) = Тип("СправочникСсылка.Посылки") Тогда
			Если не (Выборка.Коробка = Справочники.Коробки.БезКоробки или Выборка.Коробка = Справочники.Коробки.ПустаяСсылка() или Выборка.Коробка = Неопределено) Тогда
				СтоСП.Вставить_Тэг(ЗаписьXML, "groupCode", 	Формат(Число(Выборка.Коробка.Код), "ЧГ=0"));
			КонецЕсли;
			СтоСП.Вставить_Тэг(ЗаписьXML, "packageId", 		Формат(Выборка.Заказ.Код, "ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "orderType", 		"package");
		Иначе
			СтоСП.Вставить_Тэг(ЗаписьXML, "orgid", 	   		Формат(Число(Выборка.Заказ.Организатор.Код),"ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "groupCode", 		Формат(Выборка.Заказ.Код, "ЧГ=0"));
			СтоСП.Вставить_Тэг(ЗаписьXML, "orderType", 		"group");
		КонецЕсли;

		ЗаписьXML.ЗаписатьКонецЭлемента();
	КонецЦикла;
	ЗаписьXML.ЗаписатьКонецЭлемента();
	рез = ЗаписьXML.Закрыть();
	рез=СтрЗаменить(рез,"<Служебный>","");
	рез=СтрЗаменить(рез,"</Служебный>","");
	
	Возврат рез;
КонецФункции


