#Область ПрограммныйИнтерфейс

// Входящие пункты выдачи.
// Возвращает список пунктов выдачи входящих в сегмент
// 
// Параметры:
//  СегментПВ - СправочникСсылка.СегментыПунктовВыдачи - Сегмент пункта выдачи
// 
// Возвращаемое значение:
//  СписокЗначений из СправочникСсылка.ТочкиРаздачи - Входящие пункты выдачи
Функция ВходящиеПунктыВыдачи(СегментПВ) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СегментыПунктовВыдачиПунктыВыдачи.ПунктВыдачи как ПунктВыдачи
		|ИЗ
		|	Справочник.СегментыПунктовВыдачи.ПунктыВыдачи КАК СегментыПунктовВыдачиПунктыВыдачи";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СписокПунктовВыдачи = Новый СписокЗначений;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СписокПунктовВыдачи.Добавить(ВыборкаДетальныеЗаписи.ПунктВыдачи);
	КонецЦикла;
	Возврат СписокПунктовВыдачи;
КонецФункции	

#КонецОбласти

