
&НаКлиенте
Процедура ОчиститьНеПравильныеГруппы(Команда)
	СтоСПОбмен_ГруппыДоставки.УдалитьЗаказыИзНеПравильныхГрупп();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьВыделенныеГруппы(Команда)
	списокКоробок = Новый СписокЗначений;
	списокКоробок.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);
	СтоСПОбмен_ГруппыДоставки.Получить_ПоКодам(списокКоробок);
КонецПроцедуры

&НаСервере
Процедура ОчиститьСтатусГруппыНаСервере(списокКоробок)
	Для каждого элем Из списокКоробок Цикл
		об = элем.Значение.ПолучитьОбъект();
		об.СтатусГруппыДоставки = Перечисления.СтатусыГруппыДоставки.ПустаяСсылка();
		об.Записать();
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьСтатусГруппы(Команда)
	списокКоробок = Новый СписокЗначений;
	списокКоробок.ЗагрузитьЗначения(Элементы.Список.ВыделенныеСтроки);
	
	ОчиститьСтатусГруппыНаСервере(списокКоробок);
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьСтатусыГруппы(Команда)
	Группа = Элементы.Список.ТекущиеДанные.Ссылка;
	ПараметрыОтчета = Новый Структура;
	
	Результат = Новый ТабличныйДокумент;
	данныеОтчета = СП_Отчеты.СтатусыГруппы(Группа,Результат, УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("Результат",			Результат);
	ПараметрыОтчета.Вставить("Заголовок",			"Статусы "+ Группа);
	ПараметрыОтчета.Вставить("АдресРасшифровки",	данныеОтчета.АдресРасшифровки);
	ПараметрыОтчета.Вставить("АдресХранилищаСКД",	данныеОтчета.АдресХранилищаСКД);
	ОткрытьФорму("Общаяформа.ФормаПросмотраТабличногоДокумента",ПараметрыОтчета,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатИсториюЗаказов(Команда)
	Группа = Элементы.Список.ТекущиеДанные.Ссылка;
	ПараметрыОтчета = Новый Структура;
	
	Результат = Новый ТабличныйДокумент;
	данныеОтчета = СП_Отчеты.СтатусЗаказовГруппы(Группа,Результат,УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("Результат",			Результат);
	ПараметрыОтчета.Вставить("Заголовок",			"История "+ Группа);
	ПараметрыОтчета.Вставить("АдресРасшифровки",	данныеОтчета.АдресРасшифровки);
	ПараметрыОтчета.Вставить("АдресХранилищаСКД",	данныеОтчета.АдресХранилищаСКД);
	ОткрытьФорму("Общаяформа.ФормаПросмотраТабличногоДокумента",ПараметрыОтчета,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

КонецПроцедуры

&НаКлиенте
Процедура ПоказатьИсториюОбменовГруппы(Команда)
	Группа = Элементы.Список.ТекущиеДанные.Ссылка;
	ПараметрыОтчета = Новый Структура;
	
	структураОтчета 	= СП_Отчеты.ТаблицаГруппыДоставкиИстроияОбменов(Группа,УникальныйИдентификатор);

	ПараметрыОтчета.Вставить("Результат",			структураОтчета.Результат);
	ПараметрыОтчета.Вставить("Заголовок",			"Синхронизации "+ Группа);
	ПараметрыОтчета.Вставить("АдресРасшифровки",	структураОтчета.ДанныеРасшифровки);
	ПараметрыОтчета.Вставить("АдресХранилищаСКД",	структураОтчета.СКД);
	ОткрытьФорму("Общаяформа.ФормаПросмотраТабличногоДокумента",ПараметрыОтчета,ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);

	
КонецПроцедуры


