
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		//Сканер штрихкода
  	СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура 	ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если 	ИмяСобытия 	= "ScanData"					и
			Источник 	= "ПодключаемоеОборудование" 	и
			Параметр.Найти("Обработано") 	= Неопределено и
	   		ВводДоступен()   Тогда
			
			ШК = СтоСП_Клиент.ПолучитьШКизПараметров(Параметр);
			ОбработатьШКнаКлиенте(ШК);
	КонецЕсли;
КонецПроцедуры



&НаКлиенте
Процедура 	ОбработатьШКНаКлиенте(ШК)
	ДанныеШК    = СП_Штрихкоды.ПолучитьДанныеПоШК(ШК);
	Если ДанныеШК = неопределено Тогда Возврат; КонецЕсли;

	Если Строка(ДанныеШК.Тип) = "Посылка (12)"  		или
		 Строка(ДанныеШК.Тип) = "Коробка (44)"					Тогда
				 
		Если ДанныеШК.Свойство("Посылка") Тогда
			Заказ = ДанныеШК.Посылка;
		ИначеЕсли ДанныеШК.Свойство("Коробка") Тогда
			Заказ = ДанныеШК.Коробка;
		КонецЕсли;
	КонецЕсли;   
	
	ПоказатьИсторию(неопределено);
КонецПроцедуры // ОбработатьШКНаКлиенте()




&НаКлиенте
Процедура 	ВвестиШтрихКодВручную(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаВводаШК",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодВручную_Завершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура 	ВвестиШтрихКодВручную_Завершение(ШК, ДополнительныеПараметры) Экспорт
	ОбработатьШКнаКлиенте(ШК);
КонецПроцедуры	


&НаКлиенте
Процедура ПоказатьИсторию(Команда)
	ОткрытьФорму(	"Отчет.ИсторияЗаказов.Форма.ФормаОтчета",
					новый структура("мегаордер, СформироватьПриОткрытии",ШКЗаказа(Заказ) , истина),
					ЭтаФорма,,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры  
				

функция ШКЗаказа(Заказ) 
	Возврат Заказ.ШК;	
	
	
КонецФункции	
				

