



#Область КнопкиКомандныхПанелей

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере()
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНаСервере()
	об=ДанныеФормыВЗначение(Объект,Тип("ДокументОбъект.ЗакрытиеОшибокОбмена"));
	об.ЗаполнитьОшибками(Объект.Дата);
	ЗначениеВДанныеФормы(об,Объект);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("ДанныеЗаполнения" ) Тогда
		СписокСтрок = ПолучитьИзВременногоХранилища(Параметры.ДанныеЗаполнения);
		Для каждого элем из СписокСтрок Цикл
			новаяСтрока 							= Объект.Ошибки.Добавить();	
			новаяСтрока.ТипОбмена 					= элем.ТипОбмена;
			новаяСтрока.Партия 						= элем.Партия;
			новаяСтрока.СтрокаВПартии 				= элем.СтрокаВПартии;
			новаяСтрока.Мегаордер 					= элем.Штрихкод;
			новаяСтрока.Сообщение 					= элем.СообщениеОшибки;
			новаяСтрока.КоличествоНеИсправленных 	= элем.Количество;
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры


#КонецОбласти