#Область ШтрихКоды
&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если 	ИмяСобытия 	= "ScanData" и
			Источник 	= "ПодключаемоеОборудование" и
			ВводДоступен()									Тогда
			
			ШК = СтоСП_Клиент.ПолучитьШКизПараметров(Параметр);
			ОбработатьШКнаКлиенте(ШК);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьШКнаКлиенте(ШК)
	ДанныеШК    = СП_Штрихкоды.ПолучитьДанныеПоШК(ШК);
	Если ДанныеШК = Неопределено Тогда Возврат; КонецЕсли;
	Если Строка(ДанныеШК.Тип) = "Коробка (44)"      Тогда   //44352952000899132115000954   44017898000522752026005685
		ДобавитьКоробку(ДанныеШК.Коробка);
	Иначеесли Строка(ДанныеШК.Тип) = "Сотрудник (55)" 			Тогда	
		Если СП_РаботаСДокументами_Клиент.ЗаписатьДокумент(этотОбъект,,ДанныеШК.Сотрудник) Тогда
			Закрыть();
		КонецЕсли;	
	КонецЕсли;
	Модифицированность			= Истина;
КонецПроцедуры	

&НаКлиенте
Функция ДобавитьКоробку(Коробка)
	строка =Новый Структура;
	строка.Вставить("Коробка",Коробка);
	
	Если Объект.Коробки.НайтиСтроки(строка).Количество()>0 Тогда
		Если мОстанавливатьПриходПриОшибке Тогда
			Оповещение = Новый ОписаниеОповещения("ДобавитьКоробкуЗавершение",ЭтотОбъект , Коробка);
			Режим = РежимДиалогаВопрос.ДаНет;
			ПоказатьВопрос(Оповещение,"Сторока с такими данными уже внесена.Все равно добавить?" ,Режим );
			Возврат Ложь;
		КонецЕсли;
	КонецЕсли;		
	ДобавитьКоробкуЗавершение(КодВозвратаДиалога.Да, Коробка);
	Возврат Истина;
КонецФункции

&НаКлиенте
Процедура ДобавитьКоробкуЗавершение(Результат, Коробка) Экспорт
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат ;
	КонецЕсли;
	элем					=	Объект.Коробки.Добавить();
	элем.коробка			=	Коробка;	
	#Если Не ВебКлиент Тогда
	Сигнал();
	#КонецЕсли
	
	
КонецПроцедуры


&НаКлиенте
Процедура СчитатьШКВручную(Команда)
	ОткрытьФорму("ОбщаяФорма.ФормаВводаШК",,ЭтотОбъект,,,,Новый ОписаниеОповещения("ВвестиШтрихКодВручную_Завершение", ЭтотОбъект));
КонецПроцедуры

&НаКлиенте
Процедура ВвестиШтрихКодВручную_Завершение(ШК, ДополнительныеПараметры) Экспорт
	ОбработатьШКнаКлиенте(ШК);
КонецПроцедуры	


#КонецОбласти

#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	мОстанавливатьПриходПриОшибке=Константы.ОстанавливатьПриходПриОшибке.Получить();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//Сканер штрихкода
   СтоСП_Клиент.ПодключитьСканерШК(УникальныйИдентификатор);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ПослеЗаписиНаСервере();
КонецПроцедуры

Процедура ПослеЗаписиНаСервере()
	Если Константы.ВыгружатьПриходПриЗаписи.Получить()  Тогда
		аспПроцедурыОбменаДанными.СформироватИОтправитьПакет(Объект.Ссылка);
	Иначе	
		аспПроцедурыОбменаДанными.УдалитьДокументИзОтправленных(Объект.Ссылка);
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
