
Функция Отправить(ЧасовойПояс) Экспорт
	СмещениеUTCвЧасах = СмещениеСтандартногоВремени(ЧасовойПояс)/(60*60);
	хмл_отправили	= ПолучитьХМЛ(СмещениеUTCвЧасах);
	АдресСкрипта	=  Константы.АдресВыгрузкиНасайт.Получить();
	хмл_получили 	= СтоСПОбмен_Общий.Загрузить(хмл_отправили, АдресСкрипта);

	Возврат Разбор(хмл_получили);

КонецФункции	



Функция ПолучитьХМЛ(СмещениеUTCвЧасах) 
	Тип_utc				= ФабрикаXDTO.Тип("http://www.100sp.ru/out","distributors.utc");
	Тип_distributors	= ФабрикаXDTO.Тип("http://www.100sp.ru/out","distributors");
	
	Объект_utc		 	= ФабрикаXDTO.Создать(Тип_utc);
	
	ЧПизКонстанты		= Константы.ЧасовойПоясПВ.Получить();
	Если ЧПизКонстанты<>"" Тогда
		Объект_utc.value	= Число(ЧПизКонстанты);
	Иначе	
		Объект_utc.value	= СмещениеUTCвЧасах; 
	КонецЕсли;

	Объект_distributors				= ФабрикаXDTO.Создать(Тип_distributors);
	Объект_distributors.utc			= Объект_utc;
	
	Возврат СтоСПОбмен_Общий.ПолучитьСтрокуXML(Объект_distributors);
	
КонецФункции




Функция Разбор(ПолученныеДанные) 
	пространствоИмен		= "http://www.100sp.ru/api/distributor/upload/back";
	ПолученныеДанные		= СтрЗаменить(ПолученныеДанные,"http://www.100sp.ru",пространствоИмен);
	
	авторизацияВыполнена	= ложь;
	Если ПолученныеДанные 	= "Не удалось соеденится с сайтом" Тогда Возврат авторизацияВыполнена; КонецЕсли;
	
	Тип_distributors		= ФабрикаXDTO.Тип(пространствоИмен, "distributors");
	
	ЧтениеXML 				= Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(ПолученныеДанные);
 	Объект_distributors		= ФабрикаXDTO.ПрочитатьXML(ЧтениеXML,Тип_distributors);
	
	Если Объект_distributors.auth.result="ok" Тогда
		Если Объект_distributors.utc = Неопределено Тогда
			возврат Ложь
		Иначе
			Если  Объект_distributors.utc.value.result = "ok"  Тогда
				Возврат Истина;
			Иначе
				ТекстСоообщения = "Не удалось выгружить часовой пояс. Ошибка:" +Объект_distributors.utc.value.message;
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСоообщения);
				Возврат Ложь	
			КонецЕсли;	
		КонецЕсли;
//		авторизацияВыполнена=истина;
	Иначе
		ТекстСоообщения = "Не удалось выгружить часовой пояс. Не удалось подключиться к сайту";
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСоообщения);
		Возврат Ложь	
	КонецЕсли;
//	Возврат	авторизацияВыполнена;
КонецФункции


