
Процедура ПередЗаписью(Отказ)
	если ПометкаУдаления Тогда Возврат КонецЕсли;
	Взвешено=ЗначениеЗаполнено(ОтправлениеТранзита) и (
				ОтправлениеТранзита.СтоимостьДоставки>0 или
				ОтправлениеТранзита.СтоимостьДоставкиПредоплата>0 );
	удаленныеЗаказы = новый структура;			
	исключенныеЗаказы = новый структура;
	Если ВидСтикера = Перечисления.ВидыСтикеров.ГруппаДоставки Тогда
		исключенныеЗаказы 		= Состав.НайтиСтроки(новый Структура("Исключить",истина));
		удаленныеЗаказы 		= Состав.НайтиСтроки(новый Структура("Удалить",истина));
		НеобходимоИсключить	= (исключенныеЗаказы.Количество()>0);	
		НеобходимоУдалить	= (удаленныеЗаказы.Количество()>0);			
	КонецЕсли;
	Если Состав.Количество()>0 Тогда
		Количество 			= Состав.Количество() - исключенныеЗаказы.Количество() - удаленныеЗаказы.Количество();
	КонецЕсли;	
	
	Если (ЗначениеЗаполнено(Ссылка) и не ЗначениеЗаполнено(ШК)) или 
		  (ЗначениеЗаполнено(ШК) и не ЗначениеЗаполнено(ШК.Покупка)) Тогда
		Попытка
			ШК = СП_Штрихкоды.ПолучитьМегаордер(Ссылка,УчастникГД ,ТочкаНазначения, ВидСтикера );	
		Исключение
			// TODO:
		КонецПопытки;
		
	КонецЕсли;
	
	Если СтатусГруппыДоставки = Перечисления.СтатусыГруппыДоставки.empty Тогда
		Состав.Очистить();
		КоличествоНаСкладе	= 0;
	КонецЕсли;
	
#Область ЗаполнитьИтоговоеКоличествоПоОрганизаторам	
	таблицаОрганизаторов=новый ТаблицаЗначений;
	таблицаОрганизаторов.Колонки.Добавить("Организатор",новый ОписаниеТипов("СправочникСсылка.Участники"));
	таблицаОрганизаторов.Колонки.Добавить("Количество", новый ОписаниеТипов("Число"));
	Для каждого стр из Состав Цикл
		строка_итогов = таблицаОрганизаторов.Добавить();
		Если ТипЗнч(стр.Покупка)<>Тип("СправочникСсылка.Пристрой") Тогда
			строка_итогов.Организатор 	= стр.Покупка.Организатор;
		КонецЕсли;
		строка_итогов.количество 	= 1;
	КонецЦикла;
	таблицаОрганизаторов.Свернуть("Организатор","Количество");
	
	Для каждого стр из таблицаОрганизаторов Цикл
		МассивОргов	= Организаторы.НайтиСтроки(новый структура("Организатор", стр.Организатор));
		Если МассивОргов.Количество()=0 Тогда
			новаяСтрока				= Организаторы.Добавить();	
			новаяСтрока.Организатор	= стр.Организатор;
			новаяСтрока.Количество	= стр.Количество;
		Иначе	
			МассивОргов[0].Организатор 	= стр.Организатор;
			МассивОргов[0].Количество	= стр.Количество;
		КонецЕсли;	
	КонецЦикла;
#КонецОбласти
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	Если ПометкаУдаления  Тогда
		 
		 Если ЗначениеЗаполнено(ОтправлениеТранзита) Тогда
			 об_ОТ=ОтправлениеТранзита.ПолучитьОбъект();
			 об_ОТ.УстановитьПометкуУдаления(Истина);
		 КонецЕсли;
		 
		 Если ЗначениеЗаполнено(ШК) Тогда
			 мегаордер = ШК.ПолучитьОбъект();
			 мегаордер.УстановитьПометкуУдаления(Истина);
		 КонецЕсли;
	КонецЕсли;
	// Вставить содержимое обработчика.
КонецПроцедуры
