
&НаКлиенте
Процедура Обновить(Команда)
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();
	ПолучитьНеПодтвержденныеПосылки();
КонецПроцедуры


Процедура ПолучитьНеПодтвержденныеПосылки()
	
	СписокПВ = Новый СписокЗначений;
	Если ТипЗнч(ПунктВыдачи) = Тип("СправочникСсылка.СегментыПунктовВыдачи") Тогда
		Для Каждого элем из ПунктВыдачи.ПунктыВыдачи Цикл
			СписокПВ.Добавить(элем.ПунктВыдачи);
		КонецЦикла;	
	Иначе
		СписокПВ.Добавить(ПунктВыдачи);
	КонецЕсли;	
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	НеВыгруженноНаСайтОстатки.Заказ 			КАК Заказ,
		|	НеВыгруженноНаСайтОстатки.МестоХранения 	КАК МестоХранения,
		//|	НеВыгруженноНаСайтОстатки.Габарит 			КАК Габарит,
		//|	НеВыгруженноНаСайтОстатки.Коробка 			КАК Коробка,
		|	НеВыгруженноНаСайтОстатки.Партия 			КАК Партия,
		|	НеВыгруженноНаСайтОстатки.ПунктВыдачи 		КАК ПунктВыдачи,
		|	НеВыгруженноНаСайтОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.НеВыгруженноНаСайт.Остатки(, ПунктВыдачи в (&ПунктыВыдачи)) КАК НеВыгруженноНаСайтОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	НеВыгруженноНаСайтОстатки.Партия.Дата";
	
	Запрос.УстановитьПараметр("ПунктыВыдачи", СписокПВ);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТЗ = РезультатЗапроса.Выгрузить();
	
	ТЗ_рез = РеквизитФормыВЗначение("Посылки");
    МассивРеквизитов = Новый Массив;
    
    //Удалим ранее созданные колонки в ТЗ    
    Для Каждого Колонка Из ТЗ_рез.Колонки Цикл
        МассивРеквизитов.Добавить("Посылки." + Колонка.Имя);        
    КонецЦикла;
    ИзменитьРеквизиты(,МассивРеквизитов);	
	
	//Удалим отображение таблицы на форме и создадим новую
	ЭлементТаблица = Элементы.Найти("Посылки");
    Если ЭлементТаблица <> Неопределено Тогда
        Элементы.Удалить(ЭлементТаблица);        
	КонецЕсли;  
	
	
        ЭлементТаблица=Элементы.Добавить("Посылки",Тип("ТаблицаФормы"),Элементы.ГруппаПосылки);
        ЭлементТаблица.ПутьКДанным = "Посылки";
        ЭлементТаблица.Отображение = ОтображениеТаблицы.Список;
	
		
		
    //Создадим реквизиты ТЗ
    МассивРеквизитов.Очистить();
	
    Для Каждого Колонка ИЗ ТЗ.Колонки Цикл
        НоваяКолонка = Новый РеквизитФормы(Колонка.Имя, Колонка.ТипЗначения, "Посылки");
        МассивРеквизитов.Добавить(НоваяКолонка);
	КонецЦикла; 
    ИзменитьРеквизиты(МассивРеквизитов);  
   // ЗначениеВРеквизитФормы(ТЗ_рез, "ДанныеФайла");
	
    //Создаем элементы на форме для отображения колонок
    ЭлементТЗ = Элементы.Посылки;
    Для Каждого Колонка ИЗ ТЗ.Колонки Цикл
        НовыйЭлементФормы = Элементы.Добавить("Посылки"+Колонка.Имя, Тип("ПолеФормы"), ЭлементТЗ);
        НовыйЭлементФормы.Вид = ВидПоляФормы.ПолеВвода;
        НовыйЭлементФормы.ПутьКДанным = "Посылки." + Колонка.Имя;
    КонецЦикла;
        	
	Посылки.Загрузить(ТЗ);
	
КонецПроцедуры	



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//ПунктВыдачи=Параметры.ПунктВыдачи;
	ПолучитьНеПодтвержденныеПосылки();
	Если Посылки.Количество() = 0 Тогда
		Оповестить(ИсточникВызова,ПунктВыдачи,ЭтаФорма);
		Закрыть(); 
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьВЫбор(Команда)
	Оповестить(ИсточникВызова,ПунктВыдачи,ЭтаФорма);
	Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Выгрузить(Команда)
	СтоСПОбмен_Посылки.ВыгрузитьНеВыгруженныеПосылки();
	ПолучитьНеПодтвержденныеПосылки();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ИсточникВызова  = Параметры.ИсточникВызова;
	ПунктВыдачи		= Параметры.ПунктВыдачи;
КонецПроцедуры
