Процедура Синхронизировать(ОбТара) Экспорт
	оборотнаяТара = ОбТара;
	
	тз = СтоСПОбмен_ОборотнаяТара.ИсторияПоТаре(ЭтотОбъект);
	
	данныеПоТаре = тз[0];
	ТараПолучена = СП_РаботаСоСправочниками.ПолучитьОборотнуюТаруПо_Коду(данныеПоТаре.id);
	Если ОборотнаяТара <> ТараПолучена Тогда
		ОшибкаПолученаДругаяТара = Истина;
		Возврат;
	КонецЕсли;	
	история.Очистить();
	Для каждого элем из данныеПоТаре.logs.log Цикл
		новаяСтрока = история.Добавить();
		ДанныеШК = СП_Штрихкоды.ПолучитьДанныеПоШК(элем.groupStickerBarcode);
		новаяСтрока.Коробка = ДанныеШК.Коробка;
		новаяСтрока.Период = СтоСПОбмен_Общий.ДатаИзСтроки(элем.createdAt);
		новаяСтрока.ОборотнаяТара = ОборотнаяТара;
	КонецЦИкла;	
 	
КонецПроцедуры	

Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ОборотнаяТара
	Движения.ОборотнаяТара.Записывать = Истина;
	Для Каждого ТекСтрокаИстория Из История Цикл
		Движение = Движения.ОборотнаяТара.Добавить();
		Движение.Период = ТекСтрокаИстория.Период;
		Движение.Тара = ТекСтрокаИстория.ОборотнаяТара;
		Движение.Коробка = ТекСтрокаИстория.Коробка;
	КонецЦикла;

КонецПроцедуры
