
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;                                                             
	
	
	ПараметрДанных				= КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("СвояТочка");
	ПараметрДанных.Значение 	= Константы.СвояТочка.Получить();
	ПараметрДанных.Использование=Истина;	
	
    КомпоновщикМакет = Новый КомпоновщикМакетаКомпоновкиДанных;
    Макет = КомпоновщикМакет.Выполнить(СхемаКомпоновкиДанных, КомпоновщикНастроек.ПолучитьНастройки(), ДанныеРасшифровки);
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(Макет, , ДанныеРасшифровки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
    ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
    ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(3); //Уровень 3
	ДокументРезультат.ПоказатьУровеньГруппировокСтрок(2); //Уровень 3     
	
	КлючВарианта = ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта;
	Вариант = Справочники.ВариантыОтчетов.НайтиПоРеквизиту("КлючВарианта",ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.КлючВарианта);
	
	Если ЗначениеЗаполнено(Вариант) и Вариант.спСворачивать Тогда
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(1); //Уровень 2
		ДокументРезультат.ПоказатьУровеньГруппировокСтрок(0);   //Уровень 1
	КонецЕсли;	

КонецПроцедуры
