
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//КодГородаНазначения=Параметры.КодГородаНазначения;
	ПолучитьПунктыВыдачиСДЭК();
	
КонецПроцедуры

&НаКлиенте
Процедура КодГородаНазначенияПриИзменении(Элемент)
	ПолучитьПунктыВыдачиСДЭК(); 
КонецПроцедуры


Процедура ПолучитьПунктыВыдачиСДЭК() 
	Отказ = Ложь;
	Ответ = Интеграция_СДЭК_в20.СписокОфисов(новый структура("cityCode",КодГородаНазначения));
	СписокТочек.Очистить();
	Для каждого элем из Ответ.CписокОфисов Цикл
		новаяСтрока = СписокТочек.Добавить();
		ЗаполнитьЗначенияСвойств(новаяСтрока, элем);
		ЗаполнитьЗначенияСвойств(новаяСтрока, элем.location);
		КонецЦикла;	
	//тЗ=ОбменДаннымиСДЭК.ОбменССайтомСписокТочек(КодГородаНазначения,Отказ);
	//
	//Если  тЗ<>неопределено Тогда
	//	СписокТочек.Загрузить(тз);
	//КонецЕсли;
	//
КонецПроцедуры	

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КодГородаНазначения=Параметры.КодГородаНазначения;
КонецПроцедуры

&НаКлиенте
Процедура Выбрать(Команда)
	выбрали = Элементы.СписокТочек.ТекущиеДанные;
	ОповеститьОВыборе(Новый структура("Code, City_Code",выбрали.Code, выбрали.City_Code));
КонецПроцедуры

&НаКлиенте
Процедура СписокТочекВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка=Ложь;
	выбрали = Элементы.СписокТочек.ТекущиеДанные;
	ОповеститьОВыборе(Новый структура("Code, City_Code",выбрали.Code, выбрали.City_Code));

	//ОповеститьОВыборе(Элементы.СписокТочек.ТекущиеДанные);
КонецПроцедуры



